{"data_links":{"0":"https:\/\/www.churchofjesuschrist.org\/study\/general-conference\/2024\/04\/13holland?lang=eng","1":"https:\/\/www.churchofjesuschrist.org\/study\/general-conference\/2024\/04\/14dennis?lang=eng","2":"https:\/\/www.churchofjesuschrist.org\/study\/general-conference\/2024\/04\/15dushku?lang=eng","3":"https:\/\/www.churchofjesuschrist.org\/study\/general-conference\/2024\/04\/16soares?lang=eng","4":"https:\/\/www.churchofjesuschrist.org\/study\/general-conference\/2024\/04\/17gerard?lang=eng","5":"https:\/\/www.churchofjesuschrist.org\/study\/general-conference\/2024\/04\/18eyring?lang=eng","6":"https:\/\/www.churchofjesuschrist.org\/study\/general-conference\/2024\/04\/21bednar?lang=eng","7":"https:\/\/www.churchofjesuschrist.org\/study\/general-conference\/2024\/04\/22de-feo?lang=eng","8":"https:\/\/www.churchofjesuschrist.org\/study\/general-conference\/2024\/04\/23nielson?lang=eng","9":"https:\/\/www.churchofjesuschrist.org\/study\/general-conference\/2024\/04\/24alonso?lang=eng","10":"https:\/\/www.churchofjesuschrist.org\/study\/general-conference\/2024\/04\/25gong?lang=eng","11":"https:\/\/www.churchofjesuschrist.org\/study\/general-conference\/2024\/04\/26nelson?lang=eng","12":"https:\/\/www.churchofjesuschrist.org\/study\/general-conference\/2024\/04\/27cook?lang=eng","13":"https:\/\/www.churchofjesuschrist.org\/study\/general-conference\/2024\/04\/31bowen?lang=eng","14":"https:\/\/www.churchofjesuschrist.org\/study\/general-conference\/2024\/04\/32bangerter?lang=eng","15":"https:\/\/www.churchofjesuschrist.org\/study\/general-conference\/2024\/04\/33spannaus?lang=eng","16":"https:\/\/www.churchofjesuschrist.org\/study\/general-conference\/2024\/04\/34carpenter?lang=eng","17":"https:\/\/www.churchofjesuschrist.org\/study\/general-conference\/2024\/04\/35uchtdorf?lang=eng","18":"https:\/\/www.churchofjesuschrist.org\/study\/general-conference\/2024\/04\/41rasband?lang=eng","19":"https:\/\/www.churchofjesuschrist.org\/study\/general-conference\/2024\/04\/42porter?lang=eng","20":"https:\/\/www.churchofjesuschrist.org\/study\/general-conference\/2024\/04\/43renlund?lang=eng","21":"https:\/\/www.churchofjesuschrist.org\/study\/general-conference\/2024\/04\/44pieper?lang=eng","22":"https:\/\/www.churchofjesuschrist.org\/study\/general-conference\/2024\/04\/45kearon?lang=eng","23":"https:\/\/www.churchofjesuschrist.org\/study\/general-conference\/2024\/04\/46taylor?lang=eng","24":"https:\/\/www.churchofjesuschrist.org\/study\/general-conference\/2024\/04\/47oaks?lang=eng","25":"https:\/\/www.churchofjesuschrist.org\/study\/general-conference\/2024\/04\/51christofferson?lang=eng","26":"https:\/\/www.churchofjesuschrist.org\/study\/general-conference\/2024\/04\/52godoy?lang=eng","27":"https:\/\/www.churchofjesuschrist.org\/study\/general-conference\/2024\/04\/53stevenson?lang=eng","28":"https:\/\/www.churchofjesuschrist.org\/study\/general-conference\/2024\/04\/54held?lang=eng","29":"https:\/\/www.churchofjesuschrist.org\/study\/general-conference\/2024\/04\/55andersen?lang=eng","30":"https:\/\/www.churchofjesuschrist.org\/study\/general-conference\/2024\/04\/56pace?lang=eng","31":"https:\/\/www.churchofjesuschrist.org\/study\/general-conference\/2024\/04\/57nelson?lang=eng"},"speaker_key":{"0":"holland","1":"dennis","2":"dushku","3":"soares","4":"gerard","5":"eyring","6":"bednar","7":"feo","8":"nielson","9":"alonso","10":"gong","11":"nelson1","12":"cook","13":"bowen","14":"bangerter","15":"spannaus","16":"carpenter","17":"uchtdorf","18":"rasband","19":"porter","20":"renlund","21":"pieper","22":"kearon","23":"taylor","24":"oaks","25":"christofferson","26":"godoy","27":"stevenson","28":"held","29":"andersen","30":"pace","31":"nelson"},"speaker_name":{"0":"President Jeffrey R. Holland","1":"Sister J. Annette Dennis","2":"Elder Alexander Dushku","3":"Elder Ulisses Soares","4":"Elder Jack N. Gerard","5":"President Henry B. Eyring","6":"Elder David A. Bednar","7":"Elder Massimo De Feo","8":"Elder Brent H. Nielson","9":"Elder Jose L. Alonso","10":"Elder Gerrit W. Gong","11":"Brother Michael T. Nelson","12":"Elder Quentin L. Cook","13":"Elder Shayne M. Bowen","14":"Elder Steven R. Bangerter","15":"Sister Andrea Muñoz Spannaus","16":"Elder Matthew L. Carpenter","17":"Elder Dieter F. Uchtdorf","18":"Elder Ronald A. Rasband","19":"President Susan H. Porter","20":"Elder Dale G. Renlund","21":"Elder Paul B. Pieper","22":"Elder Patrick Kearon","23":"Elder Brian K. Taylor","24":"President Dallin H. Oaks","25":"Elder D. Todd Christofferson","26":"Elder Taylor G. Godoy","27":"Elder Gary E. Stevenson","28":"Elder Mathias Held","29":"Elder Neil L. Andersen","30":"President Mark L. Pace","31":"President Russell M. Nelson"},"titles":{"0":"Motions of a Hidden Fire","1":"Put Ye On the Lord Jesus Christ","2":"Pillars and Rays","3":"Covenant Confidence through Jesus Christ","4":"Integrity: A Christlike Attribute","5":"All Will Be Well Because of Temple Covenants","6":"\"Be Still, and Know That I Am God\"","7":"Rise! He Calleth Thee!","8":"A Record of What I Have Both Seen and Heard","9":"Jesus Christ at the Center of Our Lives","10":"All Things for Our Good","11":"In Support of the Rising Generation","12":"Be One with Christ","13":"Miracles, Angels, and Priesthood Power","14":"Foreordained to Serve","15":"Faithful to the End","16":"Fruit That Remains","17":"A Higher Joy","18":"Words Matter","19":"Pray, He Is There","20":"The Powerful, Virtuous Cycle of the Doctrine of Christ","21":"Trust in the Lord","22":"Gods Intent Is to Bring You Home","23":"Swallowed Up in the Joy of Christ","24":"Covenants and Responsibilities","25":"The Testimony of Jesus","26":"Call, Dont Fall","27":"Bridging the Two Great Commandments","28":"Opposition in All Things","29":"Temples, Houses of the Lord Dotting the Earth","30":"It Is Wisdom in the Lord That We Should Have the Book of Mormon","31":"Rejoice in the Gift of Priesthood Keys"},"session":{"0":"April 2024","1":"April 2024","2":"April 2024","3":"April 2024","4":"April 2024","5":"April 2024","6":"April 2024","7":"April 2024","8":"April 2024","9":"April 2024","10":"April 2024","11":"April 2024","12":"April 2024","13":"April 2024","14":"April 2024","15":"April 2024","16":"April 2024","17":"April 2024","18":"April 2024","19":"April 2024","20":"April 2024","21":"April 2024","22":"April 2024","23":"April 2024","24":"April 2024","25":"April 2024","26":"April 2024","27":"April 2024","28":"April 2024","29":"April 2024","30":"April 2024","31":"April 2024"},"text":{"0":"motion hidden firemotion hide fireapril general conference motion hidden fire president jeffrey r holland acting president quorum apostle god hear prayer offer respond accord path outline perfection brother sister learn painful lesson occupy pulpit october lesson don t acceptable talk ban conference assign early session t position trapdoor delicate latch talk doesn t win t conference spirit beautiful hymn beautiful choir learn lesson recently lord s help wish share today personal talk personal painful recent experience passing beloved wife pat great woman know perfect wife mother purity gift expression spirituality give talk title fulfil measure creation fulfil measure creation successfully dream possible complete daughter god exemplary woman christ fortunate man spend year life prove worthy sealing mean spend eternity experience begin hour wife s burial time rush hospital acute medical crisis spend week week stay intensive care consciousness virtually experience hospital period lose memory lose memory journey outside hospital edge eternity speak fully experience receive admonition return ministry urgency consecration focus savior faith word couldn t help feel receive personal version revelation give nearly year ago thou shalt bear record send forth word unto end earth morning morning day day let thy warning voice forth night cometh let inhabitant earth slumber thy speech arise cross follow beloved sister brother experience try cross earnestly resolve find raise apostolic voice warmth warn morning day night lead truth come month loss illness distress renew witness endless gratitude resolute prayer church prayer beneficiary eternally grateful supplication thousand people like importune widow repeatedly seek heaven s intervention behalf receive priesthood blessing see high school class fast random ward church prayer roll virtually temple church profound gratitude join g k chesterton say thank high form thought gratitude happiness double wonder happiness double wonder thank thank father heaven hear prayer bless life brother sister testify god hear prayer offer respond accord path outline perfection recognize roughly time pray restoration health equal number include pray restoration wife s health testify prayer hear answer divinely compassionate heavenly father prayer pat answer way ask reason know god prayer answer differently hope promise hear answer accord unfaile love cosmic timetable ask amiss limit pray accord revelation pray pray amulek say belief fervent prayer righteous people availeth prayer ought vocal privacy offer practical carry silent utterance heart sing prayer motion s hidden fire offer accord savior god eternal father begotten son beloved friend prayer sweetest hour sincere desire simple pure form worship pray individually family congregation size employ prayer shield temptation time feel pray sure hesitancy come god yearn communicate child time effort pray come directly adversary don t know exactly pray begin continue holy spirit guide prayer offer approach invoke pray enemy despitefully use ultimately look example savior pray intriguing jesus feel need pray wasn t perfect need pray come realize want seek father s face believe word trust grace time time retreat society pierce heaven prayer time pray company companion seek heaven behalf multitude cover hillside prayer glorify clothing glorify countenance stand pray knelt fall face prayer luke describe jesus s descent expiation require pray earnestly perfect pray earnestly assume prayer earnest fulfil atone sacrifice pain attend universal reach feel pray pleadingly weight offering finally bring blood pore backdrop christ s victory death recent gift week month mortality bear solemn witness reality eternal life need planning bear witness christ come need recognize nominal member list fade baptismal record thoroughly commit faithfully believe covenant keep disciple urgent matter lest hear devastating regret know joseph smith translate phrase know fortunately help task lot help need believe angel miracle promise holy priesthood need believe gift holy ghost influence good family friend power pure love christ need believe revelation prophet seer revelator president russell m nelson need believe prayer pleading personal righteousness ascend mount zion city live god heavenly place holiest brother sister repent sin come boldly throne grace leave alm heartfelt supplication find mercy compassion forgiveness benevolent hand eternal father obedient perfectly pure son job refined faithful behold world wonderful understand jesus christ amen notes doctrine covenant luke g k chesterton short history england nephi luke alma doctrine covenant alma thessalonian alma james psalm mosiah alma nephi doctrine covenant prayer soul s sincere desire hymn nephi sweet hour prayer hymn hymn alma matthew nephi helaman matthew luke nephi doctrine covenant nephi joseph smith history romans nephi doctrine covenant matthew hymn matthew matthew mark luke nephi matthew luke nephi matthew mark luke matthew joseph smith translation matthew matthew footnote doctrine covenant hebrews job","1":"ye lord jesus christput ye lord jesus christapril general conference ye lord jesus christ sister j anette dennis counselor relief society general presidency honor covenant enable god pour multitude promise blessing associate covenant young child grow discover book entertain engaging symbolism story read evening love help child understand symbolism author teach deep principle gospel principle know sink day young son early teen start new book want enjoy story mind keep try find deep meaning read frustrated smile inside jesus teach story symbol mustard seed teach power faith lose sheep teach worth soul prodigal son teach character god parable symbol teach deep lesson ear hear seek deep meaning understand read book read child know deep meaning story god father offer begotten son sacrifice jesus christ high symbol father heaven s undying love jesus christ lamb god privilege blessing invite covenant relationship god life symbol covenant covenant create kind relationship allow god mold change time lift like savior draw close close father eventually prepare enter presence person earth beloved son daughter god choose covenant enhance deepen relationship president russell m nelson teach choose covenant god relationship close covenant enable bless extra measure mercy love covenantal love refer hese hebrew language covenant path relationship god hese relationship father want deep relationship son daughter choice choose draw nearer covenant relationship allow draw nearer fully bless god set condition obligation covenant choose enter relationship witness symbolic action covenant willing abide condition set honor covenant enable god pour multitude promise blessing associate covenant include increase power change like savior jesus christ center covenant covenant blessing possible atone sacrifice baptism immersion symbolic gate enter covenant relationship god immerse water come symbolic savior s death resurrection new life baptize symbolically die bear family christ willing embody covenant symbolism new testament read baptize christ christ baptism symbolically christ ordinance sacrament point savior bread water symbolic christ s flesh blood shed gift atonement symbolically offer week priesthood holder represent savior offer bread water perform action eat drink emblem flesh blood christ symbolically christ new covenant week covenant god house lord deepen relationship temple point father s plan heart savior atone sacrifice lord teach line line symbolism ordinance covenant open heart prayerfully seek understand deep meaning temple endowment authorize wear garment holy priesthood sacred obligation sacred privilege religious tradition special outer clothing wear symbol person s belief commitment god ceremonial clothing wear lead worship service sacred vestment carry deep meaning wear read scripture ancient time sacred ceremonial clothing wear conjunction temple ritual member church jesus christ day saint choose covenant god house lord wear sacred ceremonial outer clothing temple worship symbolic clothing wear ancient temple ritual wear garment holy priesthood temple worship everyday live garment holy priesthood deeply symbolic point savior adam eve partook fruit leave garden eden give coat skin covering likely animal sacrifice coat skin symbolic savior s sacrifice kaphar basic hebrew word atonement meaning cover temple garment remind savior blessing atonement cover life garment holy priesthood day beautiful symbol new testament book romans read night far spend day hand let cast work darkness let armour light ye lord jesus christ grateful privilege wear garment holy priesthood remind savior blessing infinite atonement constantly cover mortal journey remind covenant god house lord symbolically christ armor light protect evil power increase capacity light guide darkness difficulty world deep beautiful symbolic meaning garment holy priesthood relationship christ believe willingness wear holy garment symbol personal sign god sign grateful savior jesus christ atone sacrifice great symbol father heaven s infinite love tangible symbol love sacrifice mark savior s hand foot remain resurrection covenant obligation god include wear garment holy priesthood life personal symbol love deep gratitude savior jesus christ desire invite choose deep relationship god make covenant house lord study talk prophet include beautiful teaching footnote talk conference talk speak repeatedly covenant year especially president church learn teaching beautiful blessing increase power capacity make keep covenant god general handbook state require mission engage married temple covenant person year old long attend high school equivalent member church year standard personal holiness require desire deepen relationship father heaven jesus christ make sacred covenant house lord invite speak bishop branch president let know desire help know prepare receive honor covenant covenant relationship god life live symbol commitment deep love father heaven hese desire progress eventually like savior prepare day enter presence testify great blessing covenant relationship worth price jesus christ amen note mark matthew luke luke matthew matthew john john nephi russell m nelson atonement ensign nov enter covenant god bind strap take kerry muhlestein god prevail ancient covenant modern blessing gathering israel doctrine covenant human being male female create image god beloved spirit son daughter heavenly parent divine nature destiny family proclamation world gospel library hese term describe covenant relationship party bind loyal faithful god hese covenant continue work offer opportunity change stray help find way time time covenant people old testament time enter covenant god covenant word infringe agency help russell m nelson everlasting covenant liahona oct muhlestein god prevail deuteronomy god abandon covenant relationship tire effort help exhaust merciful patience russell m nelson everlasting covenant joyfully bind everlasting covenant jeremiah nephi russell m nelson let god prevail ensign liahona nov james doctrine covenant russell m nelson covenant ensign liahona nov mosiah russell m nelson spiritual treasure ensign liahona nov russell m nelson temple spiritual foundation liahona nov russell m nelson overcome world find rest liahona nov camille n johnson jesus christ relief liahona dale g renlund access god s power covenant liahona jean b bingham covenant god strengthen protect prepare eternal glory liahona russell m nelson everlasting covenant romans colossians nephi moroni doctrine covenant galatian luke john president russell m nelson say hear expression partake sacrament renew covenant baptism s true s ve new covenant new covenant dale g renlund unwavere commitment jesus christ ensign liahona nov footnote russell m nelson everlasting covenant russell m nelson temple spiritual foundation nephi sacred temple clothing churchofjesuschrist org exodus sacred temple clothing churchofjesuschrist org genesis russell m nelson atonement romans ephesian mosiah david bednar bear burden ease ensign liahona psalm nephi eld neal maxwell teach submission s uniquely personal thing place god s altar swallow father ensign nov personal preference inconvenience style certain medical condition people wear garment difficult lord know heart understand desire honor commitment example mosiah seek judge use temple garment alma dieter f uchtdorf merciful obtain mercy ensign liahona jeffrey r holland ensign liahona john doctrine covenant isaiah russell m nelson everlasting covenant russell m nelson spiritual treasure russell m nelson let god prevail russell m nelson temple spiritual foundation russell m nelson overcome world find rest russell m nelson plea sister ensign liahona nov general handbook serve church jesus christ day saint gospel library russell m nelson closing remark ensign liahona nov russell m nelson everlasting covenant","2":"pillar rayspillar raysapril general conference pillar ray eld alexander dushku seventy pillar light ray time message worry testimony haven t overwhelming spiritual experience pray provide peace assurance restoration gospel jesus christ begin explosion light truth teenage boy upstate new york ordinary joseph smith enter grove tree pray s worried soul standing god seek forgiveness sin s confuse church join need clarity peace need light knowledge joseph kneel pray offer desire heart god thick darkness envelop evil oppressive real try stop bind tongue speak force darkness intense joseph think s go die exert s power god deliver power enemy seize moment s ready sink despair abandon self destruction doesn t know hang long glorious brilliance fill grove scatter darkness enemy soul pillar light bright sun gradually descend personage appear brightness glory defy description heavenly father speak pointing joseph beloved son hear overwhelming burst light truth restoration begin veritable flood divine revelation blessing follow new scripture restore priesthood key apostle prophet ordinance covenant reestablishment lord s true living church someday fill earth light witness jesus christ restore gospel begin boy s desperate prayer pillar light desperate need need freedom spiritual confusion worldly darkness need know reason president russell m nelson invite immerse glorious light restoration great truth restoration heaven open receive light knowledge high testify true wary spiritual trap faithful church member discouraged drift away haven t overwhelming spiritual experience haven t experience pillar light president spencer w kimball warn expect spectacular miss entirely constant flow reveal communication president joseph f smith likewise recall lord withhold marvel young show truth line line precept precept little little lord s typical pattern brother sister send pillar light lord send ray light ray light continuously pour scripture teach jesus christ light life world spirit giveth light man woman cometh world light fill s immensity space give life thing light christ literally receive gift holy ghost strive exercise faith repent honor covenant worthy receive divine ray constantly eld david bednar s memorable phrase live revelation different people experience god s light truth exactly way time think experience light spirit lord experience burst light testimony peace speak mind concern matter worry impression small voice settle mind heart urge good help ve class church youth camp feel strong desire follow jesus christ stay faithful maybe stand share testimony hope true feel maybe ve pray feel joyful assurance god love hear bear testimony jesus christ touch heart fill hope read book mormon verse speak soul god realize feel love god serve maybe struggle feel spirit moment depression anxiety precious gift faith look recognize past tender mercy lord point way receive heavenly ray testimony course dramatic form testimony brother sister see pillar light like experience divine ray year ve try treasure experience find recognize remember example life impressive precious remember rowdy teenager baptism meeting begin feel spirit urge sit reverent sit stay quiet rest meeting mission afraid testimony wasn t strong family serve mission didn t know remember study pray desperately receive certain witness jesus christ day plead heavenly father feel powerful sense light warmth know know remember awaken night year later feeling pure intelligence tell call serve elder quorum week later call remember general conference beloved member quorum apostle speak exact word testimony tell friend hope hear remember kneel hundred brother pray dear friend lie unconscious ventilator small faraway hospital heart stop unite heart plead life wake pull ventilator throat serve today stake president remember wake strong spiritual feeling vivid dream dear friend mentor pass away far early leave enormous hole life smile joyful know ok ray experience light fill burst testimony recognize remember gather ray wonderful powerful begin happen light cleaveth unto light truth embraceth truth reality power ray testimony reinforce combine line line precept precept ray ray small treasured spiritual moment time grow core light fill spiritual experience ray strong bright constitute testimony light darkness doubt overcome o real alma ask unto yea light god light lord teach receiveth light continueth god receiveth light light groweth bright bright perfect day mean brother sister time great diligence pillar light ray time midst pillar find loving heavenly father call point savior jesus christ invite hear bear witness jesus christ light life world personal world testify true live son true live god stand head true live church guide direct true living prophet apostle recognize receive glorious light choose darkness world forever jesus christ amen note joseph smith history joseph smith history joseph smith journal nov josephsmithpapers org joseph smith history joseph smith history joseph smith return home vision mother ask ok reply learn presbyterianism true emphasis add russell m nelson closing remark ensign liahona nov spencer w kimball conference report munich germany area conference quote graham w doxey voice small ensign nov teaching president church joseph f smith boy start ministry frequently ask lord marvelous thing order receive testimony lord withhold marvel show truth line line precept precept little little know truth crown head sol foot doubt fear absolutely purge send angel heaven speak trump archangel whispering small voice spirit live god give testimony possess principle power child man knowledge truth stay know truth god know father christ mosiah doctrine covenant john doctrine covenant david bednar spirit revelation doctrine covenant doctrine covenant helaman mosiah doctrine covenant nephi helaman lord identify ability believe testimony spiritual gift doctrine covenant modern revelation teach word scripture give spirit unto save power wherefore testify hear voice know word doctrine covenant mosiah moroni nephi elder gerrit w gong speak look ing eye rejoic ing lord s tender mercy life minister liahona lord s hand life clear hindsight remember ensign liahona gift gratefully recognize acknowledge hand lord life didn t recognize feel moment powerful scripture speak spiritual power remember helaman doctrine covenant precursor revelation moroni joseph smith teach person profit notice intimation spirit revelation instance feel pure intelligence flow sudden stroke idea notice find fulfil day soon e thing present unto mind spirit god come pass learn spirit god understand grow principle revelation perfect christ jesus teaching president church joseph smith ephesians doctrine covenant intelligence cleaveth unto intelligence wisdom receiveth wisdom truth embraceth truth virtue loveth virtue light cleaveth unto light alma alma emphasize light fill experience small real sense reality powerful combine form powerful doctrine covenant alma","3":"covenant confidence jesus christcovenant confidence jesus christapril general conference covenant confidence jesus christ elder ulisse soare quorum apostle enter lord s house embark sacred journey learn high holy disciple christ beloved brother sister pray spiritually renew inspire message leader weekend rejoice love covenant confidence jesus christ confidence quiet certain assurance receive blessing god promise covenant need amid challenging circumstance day construction new house lord world inspire leadership president russell m nelson cause great rejoicing church member serve important symbol expansion lord s kingdom reflect awe inspire experience dedication feather river california temple october wonder lose excitement have new temple city community neglect holy purpose sacred covenant temple inscribe temple solemn statement holiness lord inspired word clear invitation enter lord s house embark sacred journey learn high holy disciple christ covenant holiness god commit follow savior receive power change heart renew spirit deepen relationship endeavor bring sanctification soul form sacred bond god jesus christ promise inherit gift eternal life result sacred journey obtain holy high confidence day day live covenant jesus christ confidence pinnacle divine connection god help increase devotion gratitude jesus christ atone sacrifice fortify ability love serve strengthen soul live unholy world increasingly dark discourage empower overcome seed doubt despair fear frustration heartache hopelessness enemy try drive deep heart especially life hard trial long circumstance difficult biblical verse offer sound advice lean stiff wind today s worldly challenge cast away confidence dear brother sister gain genuine confidence covenant house lord jesus christ possess powerful force access life study book mormon come follow year witness nephi beautifully exemplify power type covenant confidence faithfulness face setback challenge like get plate command lord nephi despite exceedingly sorrowful fear lack faith laman lemuel remain confident lord deliver plate say unto brother lord liveth live unto father wilderness accomplish thing lord hath command nephi s confidence lord s promise able accomplish command later vision nephi behold influence type confidence write nephi behold power lamb god descend saint church lamb covenant people lord arm righteousness power god great glory see firsthand lord s love promise power flow life god s child strengthen face life s circumstance day wife come home worship temple tell deeply touch experience enter house lord see man wheelchair move slowly woman walk great difficulty cane courageously come worship lord house wife walk initiatory area see sweet sister miss arm arm beautifully celestially perform task give wife talk experience conclude pure heartfelt confidence eternal promise god provide holy covenant house cause marvelous disciple christ leave home freezing day despite personal life circumstance dear friend thing possess thing pass child grandchild help test trial ahead confidence covenant jesus christ obtain divine possession help live lord promise faithful follower disciple shall stand holy place shall move gain confidence jesus christ come humility center life savior live principle gospel jesus christ receive ordinance salvation exaltation honor covenant god holy house closing remark october general conference dear prophet remind important step achieve covenant confidence say individual worthiness enter lord s house require individual spiritual preparation individual worthiness require total conversion mind heart like lord honest citizen well example holy person change preparation enter temple change experience temple transform life outside temple shall thy confidence wax strong presence god doctrine priesthood shall distil thy soul dew heaven bishop know refer old class primary primary class temple preparation class january bishop class member teacher come office talk spend entire year prepare enter temple bishop take time applicable temple recommend interview question include primary lesson invite child prepare come bishop s office year confident covenant confident ready receive temple recommend enter lord s house year bishop young girl excited prepared confident temple want bishop print recommend new year s day m preparation isn t go temple time perpetually prepare house lord stake know adopt motto home center church support temple bind bind interesting word mean focus direction mean fasten secure resolve determine sure temple bind secure savior give proper direction stability ensure covenant confidence jesus christ intentionally enhance binding have appointment schedule lord holy house temple near far away dear prophet president russell m nelson remind vital principle say temple lie center strengthen faith spiritual fortitude savior doctrine heart temple teach temple instruction spirit increase understanding jesus christ essential ordinance bind sacred priesthood covenant covenant endow healing strengthen power oh need power day ahead savior desire prepared understand great clarity exactly act covenant heavenly father want prepared experience privilege promise responsibility prepare spiritual insight awakening need life know lord see spark desire flicker righteous effort willingness center life ordinance covenant house bless perfect way miracle tender mercy need house lord transform high holy way walk temple transform hope promise covenant arm power high temple home life assure have spirit lord s house change completely know temple want spirit lord unrestraine life simply unkind feeling give place heart mind unkind feeling thought produce unkind word action social medium home cause spirit lord withdraw heart cast away confidence let confidence wax strong ongoing accelerate building temple continue excite inspire bless important change preparation enter temple change experience temple transform life outside temple transformation fill confidence holy covenant god jesus christ god live jesus savior restore church earth reverently declare truth sacred savior jesus christ amen note exodus psalm translate equivalent temple non english speak locality doctrine covenant hebrews nephi nephi nephi doctrine covenant russell m nelson closing remark ensign liahona nov doctrine covenant merriam webster com dictionary bound russell m nelson exemplary day saint ensign liahona nov russell m nelson temple spiritual foundation liahona nov","4":"integrity christlike attributeintegrity christlike attributeapril general conference integrity christlike attribute eld jack n gerard seventy live life integrity require true god divine identity closing hour savior s ministry go mount olive garden call gethsemane invite disciple wait petition father thou willing remove cup agony suffering cause god great tremble pain bleed pore drink bitter cup shrink moment deep despair savior shrink partook finish preparation unto child man begotten father jesus christ power death pain suffering shrink fulfil covenant father manifest christlike attribute increasingly important world live attribute integrity remain true god divine identity integrity jesus christ exemplar live life integrity require true god divine identity integrity flow great commandment love god love god true time understand right wrong absolute truth god s truth integrity mean lower standard behavior impress accept right let consequence follow recent revision preach gospel missionary manual notably add integrity christlike attribute number year ago elder uchtdorf assign reorganize stake interview ask question forget life bring attention public embarrassment church surprise mind quickly race entire life try recall moment fall short ask know think church moment think eld uchtdorf ask worthiness ve come understand question integrity true profess world consistency word deed god conduct president spencer w kimball teach integrity willingness ability live belief commitment true god life integrity require foremost true god early childhood learn story daniel lion den daniel true god jealous peer seek find occasion contrive decree mandate prayer god daniel know decree go home window open knelt pray time day god israel result daniel cast lion den morn king find daniel s god deliver issue new decree tremble fear god daniel live god king come know god daniel s integrity god word deed like daniel true god increasingly set apart world savior remind world ye shall tribulation good cheer overcome world president russell m nelson counsel overcome world mean overcome temptation care thing world thing god mean trust doctrine christ philosophy man likewise resist temptation walk way image god image likeness world oppositional pull world essential god s plan salvation respond pull essence measure integrity worldly pull direct destroy fidelity marriage subtle post anonymous comment critical church doctrine culture exercise integrity choice outward expression inner commitment follow savior jesus christ true integrity flow great commandment love god true flow second love neighbor life integrity life perfection life strive day foremost true god context true president oak remind zeal second commandment cause forget world increasingly grapple integrity impose code conduct ethical rule govern relationship people institution good rule generally anchor absolute truth tend evolve base cultural acceptance similar question pose elder uchtdorf organization train employee consider decision decision make process look like publish online page major newspaper church come obscurity darkness like daniel rise worldly expectation face true live god time place say integrity insufficient action inconsistent word likewise christian kindness substitute integrity covenant people leader church reproach align standard lord set act integrity build faith trust reassure seek lord council resist outside influence follow lord s reveal process seek insight woman man act consistent inspire counsel receive focus savior careful avoid action perceive serve interest benefit family favor expense way avoid perception action influence honor man receive personal recognition generate like quote publish true divine identity finally life integrity require true divine identity know particular significance anti christ korihor lead away heart appeal carnal mind final moment life confess know god president henry b eyring teach lie contrary nature spirit divine identity korihor deceive truth contrast prophet joseph smith confidently proclaim know know god know deny joseph s brother hyrum love lord integrity heart joseph remain true end true divine identity light knowledge receive true person know conclusion reconcile god develop christlike attribute integrity follow exemplar savior world shrink live life true god divine identity job say let weigh balance god know integrity sacred jesus christ amen note matthew luke luke doctrine covenant doctrine covenant preach gospel guide share gospel jesus christ right hymn preach gospel teaching president church spencer w kimball daniel daniel daniel john russell m nelson overcome world find rest liahona nov doctrine covenant dallin h oak great commandment ensign liahona nov doctrine covenant mosiah doctrine covenant general handbook serve church jesus christ day saint gospel library doctrine covenant alma alma henry b eyring go home brigham young university devotional nov speech byu edu john joseph smith history doctrine covenant nephi job","5":"temple covenantsall temple covenantsapril general conference temple covenant president henry b eyre second counselor presidency important honor covenant temple beloved brother sister session general conference sacred time grateful assignment speak million day saint friend world love know lord love year ago privilege serve president rick college rexburg idaho morning june wife kathy drive rexburg idaho fall idaho temple attend sealing close friend course young boy home time temple trip accomplish help courageous babysitter leave precious child care short minute drive experience temple day wonderful conclusion temple sealing prepare return home notice temple worker patron nervously converse lobby temple moment temple worker tell newly construct teton dam eastern idaho collapse billion gallon million cubic meter water flow dam square mile square km neighboring valley city rexburg underwater home vehicle carry away floodwater third resident suddenly homeless imagine thought concern turn safety dear child hundred college student faculty community love mile km home day long cell phone text message way communicate immediately child drive idaho fall rexburg road close option stay night local motel idaho fall kathy knelt motel room humbly plead heavenly father safety dear child thousand affect tragic event recall kathy pace floor early hour morning worry child despite concern able mind ease fall asleep wasn t long sweet eternal companion wake say hal sleep time like word come clearly heart mind say wife kathy outcome temple covenant god seal eternal family moment spirit lord confirm heart mind know true sealing ordinance find house lord administer proper priesthood authority bind husband wife child seal truly need fear grateful later learn boy safe statement president thomas s monson good illustrate kathy feel unforgettable night attend temple come dimension spirituality feeling peace grasp true meaning word savior say peace leave peace unto let heart trouble let afraid john bless feel peace time enter sacred temple recall day walk salt lake temple young man look high white ceiling room light open sky moment thought come mind clear word light place immediately come mind voice word remember moment bear sacred place like lord come brother sister humbly testify attend temple remind eternal nature spirit relationship father divine son ultimate desire return heavenly home recent conference address president russell m nelson teach safe place spiritually live inside temple covenant believe promise god covenant people come temple person make covenant temple keep increase access power jesus christ teach covenant god leave neutral ground forever god abandon relationship forge bond fact covenant god access special kind love mercy president nelson s inspire leadership lord accelerate continue accelerate building temple world allow god s child opportunity receive ordinance salvation exaltation sacred covenant qualify sacred covenant time effort lifetime pattern lord say heart mind strength frequent participation ordinance temple create pattern devotion lord temple covenant remember invite companionship holy ghost strengthen purify experience feeling light hope testify promise true come know covenant god opportunity draw close create desire heart temple covenant promise covenant god tire effort help exhaust merciful patience sealing covenant temple receive assurance love family connection continue death eternity honor marriage family covenant temple god provide protection evil selfishness pride consistent care brother sister come persistent effort lead family lord s way child opportunity pray discern quickly beginning discord positively recognize act unselfish service especially sibling pray serve heart soften turn parent describe malachi foretell coming prophet elijah shall plant heart child promise father heart child shall turn father earth utterly waste come trial challenge heartache surely come immune thorn flesh attend temple remember covenant prepare receive personal direction lord kathy marry seal logan utah temple eld spencer w kimball perform sealing word speak give counsel hal kathy live come walk away easily initially understand counsel mean good live life way prepare leave serve lord come marry nearly year unanticipated come commissioner church education neal maxwell love counsel give president kimball temple able walk away easily reality kathy receive leave idyllic family situation california serve assignment place know family ready leave prophet holy temple place revelation see future event prepare dear brother sister bear witness important honor covenant temple matter covenant path urge qualify eligible attend temple visit frequently circumstance allow sacred covenant god assure truth share kathy middle night nearly decade ago idaho fall motel room matter outcome temple covenant sure witness jesus christ live lead church temple house lord president russell m nelson god s live prophet earth love love sacred jesus christ amen note teton dam fail ktvb capture aftermath air ktvb com thomas s monson blessing temple ensign liahona emphasis add russell m nelson temple spiritual foundation liahona nov russell m nelson overcome world find rest liahona nov russell m nelson everlasting covenant liahona oct doctrine covenant russell m nelson everlasting covenant joseph smith history corinthian","6":"know god know god april general conference know god eld david bednar quorum apostle know god heavenly father child jesus christ savior recent open house medium day new house lord lead group journalist tour sacred structure describe purpose temple church jesus christ day saint respond excellent question enter celestial room explain particular room house lord symbolically represent peace beauty heavenly home return life indicate guest speak celestial room happy answer question move stop tour exit celestial room gather location ask guest observation want share journalist say great emotion experience like entire life know quiet like exist world simply believe stillness possible strike sincerity starkness person s statement journalist s reaction highlight important aspect stillness overcome tune commotion external environment later ponder journalist s comment reflect hectic pace modern life busyness noise diversion distraction detour demand attention scripture come mind know god pray holy ghost enlighten consider high holy dimension stillness life inner spiritual stillness soul enable know remember god heavenly father child jesus christ savior remarkable blessing available church member strive faithfully covenant people lord saint missouri target intense persecution mob drive home jackson county church member try establish nearby county persecution continue threat death challenging circumstance lord reveal following instruction prophet joseph smith kirtland ohio let heart comfort concern zion flesh hand know god believe lord s admonition entail simply talk move intent remember rely power time thing place way remind focus savior unfailingly ultimate source spiritual stillness soul strengthen overcome hard thing build rock true faith focus lord jesus christ divine begotten son eternal father redemptive mission fulfil hath answer end law claimeth faith faith cleave unto good thing wherefore advocateth cause child man jesus christ redeemer mediator advocate eternal father rock build spiritual foundation life helaman explain remember remember rock redeemer christ son god ye build foundation devil shall send forth mighty wind yea shaft whirlwind yea hail mighty storm shall beat shall power drag gulf misery endless will rock ye build sure foundation foundation whereon man build fall symbolism christ rock build foundation life instructive note verse savior foundation admonish build personal spiritual foundation foundation building connect ground strong foundation provide protection natural disaster destructive force proper foundation distribute weight structure large area avoid overload underlie soil provide level surface construction imagehouse strong foundation strong reliable connection ground foundation essential structure remain sturdy stable time particular type construction anchor pin steel rod attach foundation building bedrock hard solid rock beneath surface material soil gravel imagehouse anchor bedrock similar way foundation life connect rock christ remain firm steadfast sacred covenant ordinance savior s restore gospel compare anchor pin steel rod connect building bedrock time faithfully receive review remember renew sacred covenant spiritual anchor secure firmly steadfastly rock jesus christ wherefore whoso believeth god surety hope well world yea place right hand god hope cometh faith maketh anchor soul man sure steadfast abound good work lead glorify god incrementally increasingly process time virtue garnish thought unceasingly confidence wax strong strong presence god holy ghost constant companion grounded root establish settle foundation life build savior bless spiritual assurance god heavenly father child jesus christ savior sacred time holy place home lord provide sacred time holy place help experience learn inner stillness soul example sabbath god s day sacred time set apart remember worship father son participate priesthood ordinance receive renew sacred covenant week worship lord home study fellowcitizen saint sacrament meeting holy day thought action demeanor sign god indicator love sunday know god heavenly father child jesus christ savior central feature sabbath worship house prayer offer sacrament lord s holy day house s prayer gather sabbath meetinghouse approve facility holy place reverence worship learn meetinghouse facility dedicate priesthood authority place spirit lord dwell god s child come knowledge redeemer holy place worship know surely god heavenly father child jesus christ savior temple holy place specifically set apart worship serve god learn eternal truth think act dress differently house lord place frequent holy house know god heavenly father child jesus christ savior principal purpose sacred time holy place exactly repeatedly focus attention heavenly father plan lord jesus christ atonement edify power holy ghost promise associate sacred ordinance covenant savior s restore gospel today repeat principle previously emphasize home ultimate combination sacred time holy place individual family know god heavenly father child jesus christ savior leave home worship sabbath house lord certainly essential return home spiritual perspective strength obtain holy place activity sustain focus primary purpose mortal life overcome temptation prevalent fall world ongoing sabbath temple home experience fortify power holy ghost ongoing strong covenant connection father son perfect brightness hope god s eternal promise home church gather christ trouble distress mind heart perplex circumstance challenge despair persecute recognize receive spiritual strength remain firm steadfast true promise testimony promise build foundation life rock jesus christ bless holy ghost receive individual spiritual stillness soul enable know remember god heavenly father child jesus christ savior bless overcome hard thing joyfully witness god heavenly father child jesus christ redeemer rock salvation testify sacred lord jesus christ amen note psalm doctrine covenant nephi doctrine covenant emphasis add mosiah moroni mosiah nephi moroni helaman emphasis add ephesian indicate household god church jesus christ build foundation apostle prophet jesus christ chief corner stone analogy ephesians jesus christ central component foundation church build contrast helaman indicate rock redeemer christ son god ye build foundation emphasis add foundation build life rock redeemer sure foundation foundation whereon man build fall analogy helaman jesus christ bedrock build individual live ether emphasis add moses doctrine covenant colossians peter neal maxwell overcome overcome ensign ephesian russell m nelson sabbath delight ensign liahona doctrine covenant mosiah nephi ephesian corinthian","7":"rise calleth theerise calleth theeapril general conference rise calleth thee elder massimo de feo seventy gospel way avoid challenge problem solution increase faith learn deal time ago ask wife tell far remember major problem life look say sure ll tell major problem s short memory quick smart answer realize live gospel jesus christ remove pain trial necessary grow gospel way avoid challenge problem solution increase faith learn deal sense truth month ago walk day suddenly sight blurry dark wavy scared doctor tell don t begin treatment immediately lose sight matter week scared say need intravitreal injection injection right eye wide open eye week rest life uncomfortable wake reflection come form question ask ok physical sight good spiritual vision need treatment mean clear spiritual vision ponder story blind man call bartimaeus describe gospel mark scripture say hear jesus nazareth begin cry jesus thou son david mercy technically eye jesus son joseph bartimaeus son david simply recognize jesus messiah prophesy bear descendant david interesting blind man didn t physical sight recognize jesus see spiritually couldn t physically jesus physically totally blind spiritually story learn clear spiritual vision read charge hold peace cry great deal thou son david mercy tell quiet cry know jesus ignore voice scream louder act instead act despite limited circumstance faith limitation principle learn clear spiritual vision focus jesus christ stay true know true brother sister spiritual sight intact need decide listen voice world confusing confused world stay faithful know faithful covenant faithful keep commandment reaffirm belief strong like man need cry louder testimony lord world man know jesus stay faithful believe distract voice voice today try lower voice disciple jesus christ voice world try silence s exactly declare testimony savior louder strong voice world lord count declare testimony raise voice voice don t testify jesus christ speak declare divine mission spiritual charge come knowledge jesus christ bartimaeus lord s command rise act faith scripture say cast away garment rise come jesus humble faithful man understand rise well life jesus s command know well circumstance thing hear jesus call throw away beggar s coat act instead act think don t need anymore jesus come life new day m life misery jesus start new life happiness joy don t care world think jesus call help live new life remarkable change throw away beggar s coat get rid excuse second principle clear spiritual vision leave natural man repent begin new life christ way make keep covenant rise well life jesus christ long excuse feel sorry sorry circumstance problem sorry bad thing happen life bad people think unhappy beggar s coat shoulder true time people consciously hurt need decide act faith christ remove mental emotional coat wear hide excuse sin throw away know heal good excuse way unfortunate unpleasant circumstance change justify think way decide act beggar s coat act faith mean rely savior believe atonement rise command principle word come jesus jesus blind way walk jesus hear voice principle clear spiritual vision hear voice lord allow guide man raise voice voice able listen voice lord middle voice faith allow peter walk water long keep spiritual focus lord distract wind story blind man end word receive sight follow jesus way important lesson story man exercise true faith jesus christ receive miracle ask real intent real intent follow ultimate reason blessing receive life follow jesus christ recognize make keep covenant god change nature endure end follow keep clear spiritual vision focus jesus christ spiritual sight clear eye injection grateful clearly hand lord sacred work life faith strengthen faith angel faith don t lord physically recognize spiritually know intimately testify gospel answer jesus christ answer grateful follow savior promise hear voice lord allow guide savior s covenant path bless clear vision spiritual understanding peace heart mind life cry testimony louder voice world need hear jesus christ remove beggar s coat wear rise world well life christ rid excuse follow jesus christ find good reason follow hear voice prayer jesus christ amen notes mark isaiah jeremiah matthew mark mark mark","8":"record see hearda record see heardapril general conference record see hear eld brent h nielson presidency seventy well time member church jesus christ day saint graduate law school wife marcia choose join law firm specialize trial law begin job training spend time prepare witness testify trial quickly learn fact determine courtroom witness oath testify truthfulness see hear witness testify word record preserve importance credible witness forefront preparation didn t long realize term day lawyer term gospel conversation witness testimony term use share knowledge feeling truthfulness gospel jesus christ sustain new area seventy open scripture learn duty read doctrine covenant state seventy call especial witness unto gentile world imagine eye draw term especial witness clear responsibility bear witness testify jesus christ travel world example scripture eyewitness testify see hear ancient prophet mormon begin record write mormon record thing see hear book mormon savior s apostle peter john heal man jesus christ nazareth command speak jesus respond right sight god hearken unto unto god judge ye speak thing see hear compelling testimony come book mormon saint witness visit savior jesus christ listen description witness manner bear record eye hath see hath ear hear great marvelous thing see hear jesus speak unto father brother sister today declare witness record see hear sacred ministry seventy lord jesus christ testify loving heavenly father benevolent son jesus christ suffer die rise offer eternal life god s child testify marvelous work wonder lord set hand restore gospel earth live prophet apostle testify base see hear well time member church jesus christ day saint today know knowledge independent source see hear senior year high school graduate seminary identify temple church picture temple classroom know locate year later enormous challenge operating announce temple identify personally see house lord testify lord offer blessing ordinance child world friend familysearch teach million new name add familysearch day didn t find ancestor yesterday invite look tomorrow come gather israel veil well time member church jesus christ day saint today raise child twin fall idaho perspective worldwide church limit call general authority marcia assign serve pacific area place pleased find stake new zealand temple dedicate memorize seminary find temple major city australia stake continent assignment samoa stake tonga half population member church assignment island kiribati find stake assignment visit stake ebeye marshall island daru papua new guinea service pacific island assign serve philippine surprise church jesus christ philippine grow realize stake mission operating announce temple witness church member country miss establishment christ s church world year philippine ask serve missionary department assignment take mission world view savior s worldwide church expand exponentially marcia assign visit mission asia find beautiful stake center singapore amazing faithful member visit member missionary chapel kota kinabalu malaysia meet missionary hong kong participate wonderful stake conference faithful devoted saint experience repeat meet missionary member europe latin america caribbean africa church jesus christ experience tremendous growth africa eyewitness ongoing restoration gospel jesus christ fulfilling prophecy joseph smith truth god forth boldly nobly independent till penetrate continent visit clime sweep country sound ear wonderful missionary cover globe strong work member baptize people month recently year old young man young woman help lord produce mighty miracle gathering find young woman young man small village vanuatu large city new york paris london watch teach savior remote congregation fiji large gathering place like texas california florida united states find missionary corner earth speak different language fulfil savior s great commission matthew ye teach nation baptize father son holy ghost honor past current missionary church remind rise generation president russell m nelson s invitation come gather israel testify today observe profound restoration savior s gospel eye hear ear witness god s work world well time member church jesus christ day saint today inspiring miracle restoration witness faithful member church land day saint describe nephi book mormon see day testify come pass nephi behold power lamb god descend saint church lamb covenant people lord scatter face earth arm righteousness power god great glory testify see eye nephi see covenant saint land arm righteousness power god pulpit great nation world lord impress mind king benjamin teach mosiah book mormon brent desire ye consider blessed happy state commandment god behold bless thing temporal spiritual witness see eye hear ear meet faithful saint god earth commandment covenant child father disciple jesus christ know know receive personal witness truthfulness restore gospel jesus christ savior teach bless eye ear hear direction lord leadership prophet apostle continue prepare missionary sacred covenant establish christ s church world receive blessing come commandment god united god s child know love join friend unitedly testify thing true record see hear witness testify power united witness continue forward faith lord jesus christ gospel declare witness jesus christ live savior redeemer jesus christ amen note mormon act act nephi nephi isaiah nephi teaching president church joseph smith matthew russell m nelson hope israel worldwide youth devotional june gospel library russell m nelson preach gospel peace liahona nephi mosiah matthew","9":"jesus christ center livesjesus christ center livesapril general conference jesus christ center life elder jose l alonso seventy profound question soul surface darkest hour high trial address unwavering love jesus christ journey mortality time beset trial severe pain loss love one arduous fight illness sting injustice harrowing experience harassment abuse shadow unemployment familial tribulation silent cry loneliness heartrende consequence armed conflict moment soul yearn refuge seek earnestly know find balm peace place trust help confidence strength surmount challenge possess patience encompass love omnipotent hand uplift sustain profound question soul surface darkest hour high trial address unwavering love jesus christ promise blessing restore gospel find answer seek infinite atonement offer gift measure hope healing assurance constant endure presence life gift available reach faith embrace peace redemption freely offer lord extend hand gesture essence divine love kindness invitation transcend simple divine pledge reinforce endure power grace scripture lovingly assure come unto ye labour heavy laden rest yoke learn meek lowly heart ye shall find rest unto soul yoke easy burden light clarity invitation come unto yoke affirm profound nature promise promise vast complete embody love offer solemn guarantee ye shall find rest diligently seek spiritual guidance embark deeply transformative odyssey strengthen testimony comprehend vastness heavenly father s jesus christ s perfect love heart fill gratitude humility renew desire pursue path discipleship president russell m nelson teach focus life god s plan salvation jesus christ gospel feel joy regardless happen happen life joy come alma speak son helaman declare o son helaman behold thou art thy youth beseech thee thou wilt hear word learn know whosoever shall trust god shall support trial trouble affliction shall lift day helaman speak son teach eternal principle put savior center life remember remember rock redeemer christ son god ye build foundation matthew learn hear john baptist s death jesus seek solitude large crowd follow move compassion love allow grief distract mission jesus welcome heal sick evening approach disciple face daunting challenge multitude people scant food available propose jesus send crowd away procure food jesus high love high expectation ask disciple feed instead disciple preoccupy immediate challenge jesus demonstrate trust love father couple unwavering love people direct crowd sit grass take loaf fish choose thank father acknowledge god s provision authority power give thank jesus break bread disciple distribute people miraculously food suffice abundant basket leftover group fed include thousand man woman child miracle teach profound lesson confront challenge s easy engross difficulty jesus christ exemplify power focus father offer gratitude acknowledge solution trial lie god encounter difficulty naturally tend concentrate obstacle face challenge tangible command attention principle surmount focus place christ core thought deed align outlook strength adjustment discount struggle instead help navigate divine guidance result discover solution support arise high wisdom adopt christ centric perspective empower fortitude insight turn trial victory remind savior like major problem pathway great spiritual progress story alma young book mormon present compelling narrative redemption profound impact center s life christ alma stand opponent lord s church lead astray path righteousness divine intervention mark angelic visitation awaken wrongdoing darkest hour torment guilt desperate find way spiritual anguish alma remember father s teaching jesus christ power atonement heart yearn redemption earnestly repent plead fervently lord s mercy crucial moment complete surrender bring christ forefront thought alma earnestly seek mercy trigger remarkable transformation heavy chain guilt despair vanish replace overwhelming sense joy peace jesus christ hope answer life s great pain sacrifice pay sin take suffer pain injustice sorrow fear forgive heal trust seek change life well healer comfort repair heart love power like heal time earth live water fulfil deep need soul constant love kindness like promise samaritan woman offer water spring everlasting life bear solemn witness jesus christ live preside sacred church church jesus christ day saint testify savior world prince peace king king lord lords redeemer world affirm certainty present mind heart testament restore church day call president russell m nelson prophet president church time know jesus christ give life eternal life strive place center life revelation unfold profound peace envelop infinite atonement bring forgiveness healing discover strength overcome courage persevere peace surpass understanding strive day draw nearer source good beacon hope journey presence heavenly father sacred jesus christ amen note psalm corinthian psalm jeremiah isaiah ether john romans act nephi isaiah alma matthew proverb james romans john thessalonians mosiah matthew nephi russell m nelson joy spiritual survival ensign liahona nov alma helaman matthew proverb philippian corinthian psalm ether romans nephi alma psalm peter isaiah john isaiah matthew ephesians isaiah timothy amos doctrine covenant john alma deuteronomy philippians moroni","10":"thing goodall thing goodapril general conference thing good eld gerrit w gong quorum apostle time eternity purpose creation nature god bring thing good today april anniversary jesus christ restore day church easter season joyfully testify jesus christ s perfect life atone sacrifice glorious resurrection chinese story begin man s son find beautiful horse fortunate neighbor ll say man son fall horse permanently injure unfortunate neighbor ll say man conscript army come doesn t injured son fortunate neighbor ll say man fickle world feel tempest toss uncertain fortunate unfortunate world tribulation know thing work good love god walk uprightly remember covenant thing shall work good thing good remarkable promise comfort assurance god miraculous way purpose creation nature god know begin end bring good help sanctified holy jesus christ s grace atonement jesus christ s atonement deliver redeem sin jesus christ intimately understand pain affliction sickness sorrow separation time eternity triumph death hell thing right help heal break disparage reconcile angry divide comfort lonely isolated encourage uncertain imperfect bring forth miracle possible god sing hallelujah shout hosanna eternal power infinite goodness god s plan happiness thing work good face life confidence fear leave know good choose choose limitation weakness inadequacy ultimately good good save god good seek perfection jesus christ true good self natural man woman child god trust faith god trial affliction consecrate good joseph sell slavery egypt later save family people prophet joseph smith s incarceration liberty jail teach thing shall thee experience shall thy good live faith trial sacrifice choose bless way imagine increase faith trust lord thing work good gain eternal perspective understand trial small moment recognize affliction consecrate gain acknowledge accident untimely death debilitate illness disease mortality trust love heavenly father trial punish judge stone ask bread serpent ask fish trial come want listen moment clich answer unhelpful comfort intent yearn grieve ache weep let express pain frustration anger acknowledge thing know trust god love great heartbreak end work good remember day receive word car accident involve love time anguish faith job lord give lord hath take away bless lord worldwide church stake district ward branch provide refuge safety stake ward faithful family individual confront difficult challenge know know thing work good huddersfield england brother samuel bridgstock diagnose stage cancer shortly calling new stake president give dire diagnosis ask wife anna interview sister bridgstock say go call stake president imagebridgstock family initially give year live president bridgstock today fourth year service good hard day stake rally increase faith service kindness easy wife family live faith gratitude understandable sadness trust eternal joy jesus christ s restore atonement open reverent feel beauty purpose serenity covenant belong lord offer sacred moment let glimpse large eternal reality daily life small simple thing work good giver receiver rebekah daughter mission president share lord answer prayer comfort unexpected opportunity answer s prayer imagerebekah give woman mother s oxygen machine late evening rebekah grieve mother s recent passing clear impression buy gas car arrive station meet elderly woman struggle breathe large oxygen tank later rebekah able woman mother s portable oxygen machine sister gratefully say ve give freedom thing work good minister jesus christ father assign teacher age son minister companion explain minister neighbor bring cookie trust friend spiritual responder covenant belong jesus christ comfort connect consecrate tragedy spiritual preparation remind heavenly father know feel vulnerable example family child take hospital later find comfort remember holy ghost whisper advance expect large eternal reality lord let feel include family veil sister find joy conversion jesus christ s restore gospel trauma deeply impact life see boat accident tragically lose mother take life imagesister overcome fear baptize sister overcome fear water baptize immersion happy day witness act proxy deceased mother baptize temple temple baptism heal mother free sister say time feel peace mother die sacred music echo assurance thing work good soul thy god doth undertake guide future past thy hope thy confidence let shake mysterious shall bright come come ye saint toil labor fear joy wend way hard journey appear grace shall day die journey s happy day book mormon evidence hold hand jesus christ god fulfill prophecy write inspire prophet see day book mormon begin raw drama family deal deep difference study ponder nephi moroni draw jesus christ firm testimony happen bless lord live prophet bring house lord close place temple blessing work good come covenant ordinance god father jesus christ gain eternal perspective mortality offer beloved family member ancestor sacred ordinance covenant blessing lord s pattern savior mount zion temple come close place temple sacrifice offer seek holiness house lord frequently year save plan sacrifice come temple circumstance permit come lord holy house let regular temple worship service bless protect inspire family family family someday imagegrandmother outside temple circumstance permit consider blessing own temple clothe grandmother humble family say world want temple clothe grandson say grandma whisper serve temple clothe die bury time come president russell m nelson teach believe promise god covenant people come temple time eternity purpose creation nature god bring thing good lord s eternal purpose eternal perspective eternal promise life cluttered purpose isn t clear want live well don t know come god father jesus christ trust live love want thing good testify infinitely eternally sacred holy jesus christ amen note john romans doctrine covenant popular phrase s good imply thing ok order necessarily mean actually good moses alma nephi god respect moral agency allow unrighteous act affect willingly seek jesus christ s grace enabling atone power cleanse heal bind reconcile side veil moroni professor terry warner write perceptively topic romans moroni moroni doctrine covenant learn experience choose bear burden lord s help increase capacity bear burden mosiah illustrate lord s promise visit people affliction strengthen bear burden alma teach burden light joy son mosiah remind willing bear s burden light prophet isaiah speak messiah spirit lord god lord hath anoint preach good tiding unto meek hath send bind brokenhearted comfort mourn appoint unto mourn zion unto beauty ashe oil joy mourn garment praise spirit heaviness isaiah likewise psalmist offer lord s promise perspective weeping endure night joy cometh morning psalm include glorious promise righteous morning resurrection doctrine covenant believe trial eternity small moment mean downplay try challenge agonizing pain suffer experience day day life unbearable sleepless night excruciating uncertainty new day promise able look mortal suffering light god s compassion eternal view add perspective understanding mortality hope endure faith trust end eye good need necessarily wait future time good nephi matthew let god prevail life passively accept come actively believe heavenly father savior jesus christ want good tragedy strike ask faith learn mourn broken heart contrite spirit know time way compensate blessing opportunity come covenant mourn mourn comfort stand need comfort mosiah job doctrine covenant faith face difficulty opposite existential anguish despair book mormon describe curse god wish die struggle sword life mormon soul hymn come come ye saint hymn consider great wisdom love redemption s grand design justice love mercy meet harmony divine great wisdom love hymn amid life s uncertainty know redemption s grand design bring justice love mercy good obadiah prophet joseph smith teach day saint savior mount zion build temple erect baptismal font go forth receive ordinance behalf progenitor dead teaching president church joseph smith member attend temple time purchase temple clothe significant discount russell m nelson temple spiritual foundation liahona nov","11":"support rise generationin support rise generationapril general conference support rise generation brother michael t nelson second counselor young man general presidency relationship life youth great influence choice prepare speak draw story helaman striple son people ammon feel power book mormon prophet teach parent bishop ward member study account helaman man young ammonites trust help develop mature righteousness know love leader helaman love young man like son see potential elder dale g renlund teach effectively serve heavenly father s eye begin comprehend true worth soul sense love heavenly father child bishop today bless discernment divine identity youth care helaman number young man care prioritize build strong relationship critical time life death hang balance helaman young warrior lose track army pursue helaman counsel youth behold know halt purpose come ye son faithful young man respond father behold god suffer fall let forth day win helaman support young man resolve act young ammonites great cause valiant support people little force lead helaman spread great hope joy heart experienced nephite army bishop today lead uniquely gifted youth bless ward gather israel president russell m nelson teach mission send earth like young ammonite true time whatsoever thing entrust helaman faithfully follow leader matter challenge setback helaman remain fix determination advance purpose direct march forth little son obey youth today bless bishop follow guidance leader counsel ward young woman president s stake president ensure bishop young woman president instruct fulfil responsibility youth helaman honor covenant ammon teach gospel parent stripling young man parent embrace open heart committed new life righteous discipleship covenant lay weapon rebellion thing cause consider break covenant go familiar past fighting see nephite danger ammonites want help people offer safe home helaman persuade covenant fight trust strength god provide strength ammonites provide sword arrow helaman young warrior face daunt challenge helaman resolute behold mattereth trust god deliver instance verge starve death response pour soul prayer god strengthen deliver lord visit assurance deliver exceed faith teach believe learn helaman young man support parent faithful parent know primary responsibility teach child teach child commandment walk uprightly god mother teach doubt god deliver father set powerful example covenant make warrior know horror battle entrust inexperienced son helaman s care support send provision helaman wasn t serve young army people turn support guidance reach captain moroni help come serve lord s kingdom serve lord bless ward stake restore organization resource wisdom inspiration meet challenge bishop provide guidance ward council promote quarterly minister interview encourage elder quorum relief society fulfill responsibility minister family presidency lead assess need find inspire solution stake president offer support instruct elder quorum relief society presidency responsibility need guidance leader parent find gospel library gospel living app inspire resource find scripture teaching modern prophet general handbook youth tab gospel library resource quorum class presidency strength youth guide make choice member ward study inspire source seek guidance spirit direct lord strengthen youth entire ward bless strengthen member focus rise generation despite imperfection shortcoming heavenly father invite companionship spirit reach know grow sanctify follow prompting holy ghost doesn t matter effort imperfect partner lord trust effort line youth follow direction holy ghost reach youth witness heavenly father s love life act prompting lord build relationship love trust relationship life youth great influence choice youth learn pattern revelation participate process seek act prompting serve youth turn lord inspire guidance relationship trust deepen express confidence youth offer support direction take step allow youth learn counseling choose inspire course put plan action experience true joy growth president henry b eyring teach matter learn guess win t learn lecture feeling think think youth amaze courage faith ability choose fully engage disciple jesus christ gospel etch heart follow helaman help young ammonite valiant disciple jesus christ live powerful example youth disciple christ live today faithful parent pray example life child program replace influence love covenant keep adult president priest quorum bishop set example youth loyal husband love father protect provide preside righteous way bishop laser like focus youth influence generation youth today heavenly father s noble spirit stalwart defender truth agency premortal world bear day gather israel powerful witness lord jesus christ know know great potential patient grow redeem protect heal guide inspire parent leader prepare support savior s church assist raise generation bear witness christ s church restore prophet joseph smith lead today president russell m nelson organize help youth fulfill great purpose day jesus christ amen note alma choose want big big grand majestic good lord send world capacity smart wise impact world previous generation russell m nelson hope israel worldwide youth devotional june gospel library dale g renlund god s eye ensign liahona nov alma alma alma heavenly father s goal parenting child right child choose right dale g renlund choose day ensign liahona nov empower youth invite allow act church forward miraculous way meeting eld david bednar temple family history leadership instruction feb gospel library alma alma russell m nelson hope israel gospel library alma alma alma general handbook serve church jesus christ day saint gospel library general handbook alma alma alma alma alma alma alma alma general handbook seek eternal truth follow question help recognize concept come god source concept teach consistently scripture live prophet concept confirm witness holy ghost god reveal doctrinal truth prophet holy ghost confirm truth help apply john c pingree jr eternal truth liahona nov doctrine covenant youth underwhelme god s work likely overwhelm world deacon teacher quorum presidency consist merely call offer prayer pass sacrament brother special spirit thing significance give chance neal maxwell unto rise generation ensign apr henry b eyring teaching moral act address give brigham young university annual conference aug speech byu edu aaronic priesthood quorum theme gospel library family proclamation world gospel library hope bishopric great emphasis focus priesthood responsibility young man help quorum duty capable adult young man adviser call assist aaronic priesthood quorum presidency bishopric duty confident young man young woman rise challenge stay covenant path laser like focus youth quentin l cook adjustment strengthen youth ensign liahona nov heavenly father reserve noble spirit fine team final phase noble spirit fine player hero russell m nelson hope israel gospel library teenager love valiant warrior agency truth help way react determination choose sense faithful warrior premortal existence commit defense moral agency aware great value bring happiness faithful warrior premortal existence claim independence sign potential sign test power agency bring happiness henry b eyre life found light truth brigham young university devotional aug speech byu edu","12":"christbe christapril general conference christ elder quentin l cook quorum apostle unite love faith jesus christ atonement essence truly belong christ feel deeply atonement jesus christ young reality savior s atonement come home graduate stanford law school study california bar exam mother call say grandfather crozier kimball live utah die say want well come home grandfather ill wonderful visit pleased share testimony crozier year old father david patten kimball die age crozier hope father grandfather heber c kimball approve life feel true heritage grandfather s primary counsel avoid sense entitlement privilege faithful ancestor tell focus savior savior s atonement say child loving heavenly father regardless earthly ancestor report savior keep commandment grandpa refer savior keeper gate reference nephi tell hope sufficiently repentant qualify savior s mercy deeply touch know righteous man patriarch serve mission teach return god good work benefit savior s atonement remember day great love appreciation grandpa savior atonement assignment jerusalem visit upper room near site savior wash apostle foot prior crucifixion spiritually touch think command apostle love recall savior s plead intercessory prayer behalf prayer occur literally close hour mortal life record gospel john prayer direct follower christ include savior s petition father plead thou father art thee savior continue glory thou gavest give oneness christ pray prior betrayal crucifixion oneness christ heavenly father obtain savior s atonement lord s save mercy dependent lineage education economic status race base christ commandment prophet joseph smith oliver cowdery receive revelation church organization government soon church organize section read prophet joseph church conference revelation approve common consent content revelation truly remarkable teach significance role savior access power blessing atone grace prophet joseph year old receive numerous revelation complete translation book mormon gift power god joseph oliver identify ordain apostle have authority preside church verse contain summary essential church doctrine include reality god creation mankind fall heavenly father s plan salvation atonement jesus christ verse contain essential requirement baptism lord s church verse set forth sacrament prayer utilize sabbath doctrine principle sacrament practice lord establish joseph smith prophet restoration truly seminal requirement baptism profound uniquely simple primarily include humility god broken heart contrite spirit repenting sin take jesus christ endure end show work receive spirit christ significant qualification baptism spiritual economic social attainment necessary poor rich spiritual requirement race gender ethnicity requirement book mormon make clear invite partake lord s goodness black white bond free male female alike unto god man privilege like unto forbid give likeness god make little sense emphasize difference wrongly encourage imagine people different actually real small difference magnify chasm addition wrongly assume people invite receive goodness eternal life conduct requirement scripture attest accountable person require repent sin commandment lord make clear moral agency free choose liberty eternal life great mediator man hearken unto great commandment faithful unto word choose eternal life receive blessing savior s atonement affirmatively exercise moral agency choose christ obey commandment life meaning agency free dissect debate continue intellectual argument topic recent cover major university alumnus publication prominent biologist professor assert s room free surprisingly professor quote article say s thing god s free vast indifferent universe disagree strongly fundamental doctrine faith moral agency include free agency ability choose act essential plan salvation moral agency learn progress choose christ moral agency free choose liberty eternal life premortal council heaven father s plan include agency essential element lucifer rebel seek destroy agency man accordingly privilege have mortal body deny satan follow premortal spirit exercise agency follow heavenly father s plan spirit bless birth mortal life continue agency free choose act control consequence choice good righteousness lead happiness peace eternal life choice sin evil eventually lead heartache misery alma say wickedness happiness extremely competitive world constant effort excel strive good righteous worthwhile endeavor consistent lord s doctrine effort diminish deprecate create barrier success contrary lord s doctrine blame circumstance decision act contrary god s commandment today s world easy focus material occupational success lose sight eternal principle choice eternal significance wise follow president russell m nelson s counsel think celestial significant choice regardless talent ability opportunity economic circumstance emphasis put family choice essential clear scripture think account nephi lehi depart wilderness leave house land inheritance gold silver precious thing take save family face vicissitude life event occur little control health challenge accident obviously fit category recent covid pandemic severely impact people right important choice control go missionary day elder marion d hank mission president memorize poem ella wheeler wilcox chance destiny fate circumvent hinder control firm resolve determined soul matter principle conduct religious observance righteous living control faith worship god father son jesus christ choice understand advocate interest education occupation say effort relate education occupation elevate family christ unintended consequence significantly adverse clear simple doctrine set forth doctrine covenant touching compelling amplify clarify sacred spiritual concept teach salvation come jesus christ justifie sanctifie repentant soul savior s grace set stage preeminent role atonement strive include circle oneness follow president russell m nelson s admonition gather scatter israel side veil need include circle oneness president nelson beautifully teach continent isle sea faithful people gather church jesus christ day saint difference culture language gender race nationality fade insignificance faithful enter covenant path come unto beloved redeemer unite love faith jesus christ child love heavenly father essence truly belong christ ordinance baptism sacrament set forth doctrine covenant temple covenant unite special way allow eternally significant way live peace harmony bear sure certain witness jesus christ live atonement christ sacred jesus christ amen note david age helped carry saint ice fill sweetwater river strand high plain wyoming saint story church jesus christ day volume unhallowed hand moroni chief rabbi norway rabbi michael melchior keynote speaker jewish day saint scholar dialogue hold june byu jerusalem center israel john john conference minute record book christ s church day saint commonly know far west record june church history library salt lake city steven c harper making sense doctrine covenant doctrine covenant revelation publish church newspaper utilize missionary respect doctrine administration ordinance baptism sacrament harper making sense doctrine covenant nephi doctrine covenant nephi nephi peter wood diversity invention concept nehor take position alma doctrine covenant nephi stanford publication stanford alumni association dec cover sam scott choice stanford dec article identify professor robert sapolsky stanford professor biology neurology neurosurgery good selling author science book article contain oppose view include alfred mele professor philosophy florida state university head large john templeton foundation project free state scientist definitely prove free ambitious free illusion scott choice d todd christofferson moral agency brigham young university devotional jan speech byu edu doctrine covenant nephi moses true faith gospel reference alma russell m nelson think celestial liahona nov nephi poetical work ella wheeler wilcox love quote share elder neal maxwell state succinct fashion choose kingdom god end difference choose instead attribute william law th century english clergyman quote neal maxwell response ensign doctrine covenant calvinist theology emphasize justification sanctification fall soul grace jesus christ teach god predestine soul salvation change outcome doctrine covenant make clean break calvinism read possibility man fall grace depart live god doctrine covenant harper making sense doctrine covenant russell m nelson build bridge new era aug liahona dec","13":"miracle angel priesthood powermiracle angel priesthood powerapril general conference miracle angel priesthood power eld shayne m bowen seventy desire blessing priesthood include miracle ministry angel walk path covenant god available today miracle long exist angel fictional heaven close testify miracle cease angel heaven truly open savior jesus christ earth give priesthood key chief apostle peter key peter apostle lead savior s church apostle die key priesthood take earth testify ancient key priesthood restore peter james john ancient prophet appear resurrect being bestow prophet joseph smith lord describe key kingdom dispensation gospel key pass prophet prophet today man sustain prophet seer revelator use lead savior s church ancient time senior apostle hold authorize exercise priesthood key president russell m nelson prophet president restore church christ day church jesus christ day saint savior s church receive blessing priesthood include power god help life authorize priesthood key sacred promise god receive sacred ordinance prepare live presence begin baptism confirmation temple forward path covenant lead hand lay head receive priesthood blessing include direction comfort counsel healing power follow jesus christ life bless great power reveal scripture refer power holy melchizedek priesthood youth gain great respect power especially manifest priesthood blessing serve young missionary chile companion arrest separate tell time great political upheaval thousand people take custody military police hear interrogate sit jail cell know love one turn heavenly father fervently plead father teach thou watcheth thy missionary father special obedient need thy help tonight seed help plant year early baptism confirm member church give gift holy ghost pray bar holy ghost immediately come comfort bring mind special passage patriarchal blessing blessing priesthood god promise faithfulness able seal temple time eternity woman beauty virtue love parent precious son daughter bless magnify father israel inspire word future fill soul peace know come love heavenly father keep promise moment assurance release live promise fulfil year later heavenly father bless wife beauty virtue love lynette seal temple bless precious son precious daughter father accord god s promise patriarchal blessing receive year old boy wherefore beloved brother sister miracle cease christ hath ascend heaven nay angel cease minister unto child man testify miracle ministration continually occur life direct result priesthood power priesthood blessing fulfil immediately way understand unfold gradually fully realize life god keep promise illustrate account family history paternal grandfather grant reese bowen man great faith vividly remember hear recount receive patriarchal blessing journal record patriarch promise gift healing say sick shall heal yea dead shall raise hand year later grandfather pile hay felt prompt return house meet father come grant mother pass away father say quote grandfather s journal didn t stop go hurry house porch lie cot look sign life leave remember patriarchal blessing promise faithful faith sick heal dead raise place hand head tell lord promise patriarch true manifest time raise mother life promise hesitate power building kingdom pray open eye say grant raise spirit world call let testimony rest family president russell m nelson teach seek expect miracle testify priesthood restore power authority god earth calling council man woman young old participate priesthood work work miracle attend angel work heaven bless god s child family seven return ward outing late lynette expect sixth child feel strong prompting fasten seat belt forget shortly come bend road car cross line lane go mile km hour swerve avoid hit oncoming car van roll skid highway slide road finally come stop land passenger dirt thing remember hearing lynette s voice shayne need door hang air seat belt take second orient start lift child van window ceiling van cry wonder happen soon realize year old daughter emily miss yell response ward member travel home scene frantically look dark look van flashlight horror see emily s tiny body trap van call desperately lift van emily grab roof pull lift van miraculously flip wheel expose emily s lifeless body emily breathe face color purple plum say need blessing dear friend ward member kneel authority melchizedek priesthood jesus christ command live moment emily take long raspy breath like hour ambulance finally arrive emily rush hospital collapse lung sever tendon knee brain damage concern time oxygen emily coma day half continue pray fast bless recovery today emily husband kevin parent daughter miraculously able walk away baby lynette carry tyson spare harm bear february month later receive earthly body tyson return home heavenly father guardian angel son feel influence family look forward lift van emily observe van weigh know heavenly angel join earthly angel lift vehicle emily s body know emily bring life power holy priesthood lord reveal truth servant face right hand left spirit shall heart angel round bear testify holy priesthood order son god melchizedek priesthood key authority power restore earth day know circumstance turn like hope pray god s miracle come accord timing plan desire blessing priesthood include miracle ministry angel invite walk path covenant god available member leader church love help step testify jesus christ son god live lead church live prophet hold exercise priesthood key holy ghost real savior give life heal reclaim bring home witness miracle cease angel heaven open oh open jesus christ amen note matthew doctrine covenant doctrine covenant doctrine covenant doctrine covenant moroni russell m nelson power spiritual momentum liahona shayne m bowen live ye shall live ensign liahona nov doctrine covenant doctrine covenant","14":"foreordain serveforeordaine serveapril general conference foreordain serve eld steven r bangerter seventy heavenly father desire reveal personal foreordination seek learn follow evening speak youth church rise generation young man young woman standard bearer generation october beloved prophet president russell m nelson declare heavenly father know long time son daughter choose come earth precise time leader great work earth year ago president nelson continue today reaffirm strongly lord ask worthy able young man prepare serve mission day saint young man missionary service priesthood responsibility young man reserve time promise gathering israel take place young able sister mission powerful optional opportunity pray know lord serve mission holy ghost respond heart mind prophet s reference lord hold youth day reserve time gathering israel invitation pray know lord reference life live blessing receive god bear earth bear earth live heavenly father spirit child lord declare moses lord god create thing spiritually naturally face earth create spiritually love spirit son daughter embed divine nature eternal destiny premortal life develop identity increase spiritual capability bless gift agency ability choice important decision decision follow heavenly father s plan happiness obtain physical body gain earthly experience progress ultimately realize divine destiny heir eternal life decision affect life premortal life continue affect life child god live premortal life grow intelligence learn love truth bear god appoint fulfill specific mission mortal life earth remain worthy blessing premortal decree enable kind opportunity life include opportunity serve church participate important work happen earth today gathering israel premortal promise blessing call foreordination doctrine foreordination apply member church foreordination guarantee receive certain calling responsibility blessing opportunity come life result righteous exercise agency foreordination premortal life come result righteousness prove worthy progress covenant path receive opportunity serve young woman class priesthood quorum bless serve temple minister brother sister serve mission disciple jesus christ matter seek know understand foreordination day question abound seek know true identity fact god know bless individually bear earth essential characteristic s premortal mortal eternal identity purpose bring sweet peace assurance mind heart know begin understand god s foreordained blessing bestow bear earth heavenly father desire reveal personal foreordination seek learn follow love read president nelson s instagram post favorite july write believe lord speak directly thing sure understand true identity dear friend literally spirit child god mistake potential divine diligent seek god glimpse share earthly father teach discover identity god s plan life saturday morning year old mow grass weekly chore finish hear door close house look father call join walk porch invite sit step beautiful morning recall sit close shoulder touch begin tell love ask goal life think s easy know thing sure want tall want camping simple soul smile pause moment say steve d like share s important ve pray heavenly father cause indelibly imprint mind soul ll forget father attention moment turn look eye say son protect private time life long pause let meaning sink deep heart continue know time know time think doesn t affect say time life private time life great impact confront challenge heartache face private time life great impact confront success joy experience time life father receive wish heart sound cadence voice love feel word indelibly imprint mind soul day learn year great miracle day step childhood home private time life god prayer receive revelation father teach learn god s foreordain blessing private moment learn book mormon word god learn god foreordain serve mission learn god know hear answer prayer learn jesus christ savior redeemer mistake memorable day father strive protect private time life remain anchor amid storm life enable seek safe haven healing strengthen blessing savior s love atone sacrifice young brother sister protect private time life wholesome recreation listen uplift music read scripture have regular meaningful prayer make effort receive ponder patriarchal blessing receive revelation president nelson s word eye wide open truth life time decide kind life want live forever father heaven answer prayer especially prayer offer private time life reveal foreordained gift talent feel love envelop sincerely ask genuinely desire know protect private time life participation ordinance covenant gospel meaningful fully bind god covenant lift great hope faith assurance promise want know god s plan bear witness want know inspire prophet world invite pray receive eye opening experience bear witness reality power savior s atone sacrifice make possible live enjoy god s foreordain blessing jesus christ amen note russell m nelson decision eternity ensign liahona nov russell m nelson preach gospel peace liahona russell m nelson hope israel worldwide youth devotional june gospel library heavenly father reserve noble spirit fine team final phase noble spirit fine player hero jeremiah moses family proclamation world gospel library young woman theme gospel library aaronic priesthood quorum theme gospel library topic question premortal life overview gospel library family proclamation world gospel library alma topic question premortal life overview gospel library doctrine covenant topic question foreordination gospel library russell m nelson hope israel topic question foreordination gospel library jeremiah relationship foreordination agency liahona oct guide scripture foreordination gospel library alma doctrine covenant family proclamation world gospel library jeremiah russell m nelson instagram july instagram com russellmnelson russell m nelson choice eternity worldwide devotional young adult gospel library russell m nelson revelation church revelation life ensign liahona","15":"faithful endfaithful endapril general conference faithful end sister andrea mu oz spannaus second counselor young woman general presidency hand able bring goliath appear life dear young friend today like speak directly youth church s year young woman general presidency call happen past year meet study teaching christ sing song new friend serve community strengthen listen testimony youth conference world event worship house lord time share message lord jesus christ tonight different message youth church jesus christ big question wonder faithful god live world sin strength forward continue good experience true joy think experience david goliath help david goliath old testament army philistines battle israelites morning evening giant philistine name goliath challenge israelite fight imagedavid goliath israelite people live david young shepherd small goliath giant faith jesus christ david volunteer fight king try dissuade david choose trust jesus christ previously david fight lion bear experience know god protect victorious david cause god important cause faith god abandon gather smooth stone take sling go face giant imagedavid s stone scripture tell stone david threw hit goliath s forehead end life search answer david stone kill goliath prepare make think prepare face world david s stone represent strength need triumphant life stone think possibility stone love god stone faith savior jesus christ stone knowledge true identity stone daily repentance stone access god s power let s talk bless strength stone love god love god great commandment strength youth guide teach god love father perfect love inspire love love heavenly father important influence life decision easy love god close relationship strength need transform heart easily overcome challenge second stone faith savior jesus christ jesus christ come earth suffer sin take sorrow pain weakness physical mental illness s know help have faith jesus christ mean fully trust wisdom time love power atone sin stone faith jesus christ defeat giant life overcome fallen world overcome number stone knowledge true identity beloved prophet president russell m nelson teach important identity child god child covenant disciple jesus christ change know doubt ability repeat mind loud daughter god daughter god time need feel confident go fourth stone daily repentance strength youth guide read repentance isn t punishment sin way savior free sin repent mean change turn away sin god mean improve receive forgiveness kind change time event s ongoing process liberating feel god s forgiveness know clean reconcile forgiveness possible fifth stone stone access god s power covenant god ordinance baptism access power godliness god s power real power help face challenge good decision increase capacity endure difficult situation power grow specific ability need strength youth guide explain covenant connect heavenly father savior increase god s power life let s talk connection remember christ teach difference house build rock sand eld dieter f uchtdorf explain house doesn t survive storm house strong doesn t survive rock strong house survive storm firmly attach strong rock s strength connection rock matter imagehouse build rock personal connection jesus christ courage confidence forward amid people respect belief bully christ invite thought constantly tell look unto thought think savior give clarity mind decision act fear contrary god s teaching day difficult feel like t thinking christ bring peace give hope draw power jesus christ obey covenant increase faith jesus christ key actually wish david stone stone testimony testimony build personal spiritual experience recognize divine influence life knowledge know know having live spiritual experience priceless true knowledge give freedom give joy love truth seek find defend invitation choose stone number invite meet class quorum family think strength need acquire remain faithful god overcome world promise dear friend christ eager accompany journey life promise hold iron rod walk hand hand jesus christ guide teach hand able bring goliath appear life testimony testify joy pray day read book mormon day partaking sacrament sunday go seminary early morning joy good joy faithful god universe savior world king king joy disciple jesus christ god father know heart s desire possibility trust dear youth jesus christ help faithful end truth bear testimony jesus christ amen note samuel samuel matthew strength youth guide make choice alma nephi russell m nelson overcome world find rest liahona nov russell m nelson choice eternity worldwide devotional young adult gospel library young woman theme aaronic priesthood quorum theme gospel library strength youth russell m nelson power spiritual momentum liahona doctrine covenant general handbook serve church jesus christ day saint gospel library strength youth emphasis add nephi dieter f uchtdorf strength youth savior s message strength youth mar doctrine covenant emphasis add doctrine covenant dallin h oak testimony ensign liahona alma strength youth love truth want steal lie cheat deceive way school work online faithful follower jesus christ public private nephi helaman nephi","16":"fruit remainsfruit remainsapril general conference fruit remain elder matthew l carpenter seventy have holy ghost seal ordinance essential want promise blessing eternity young boy love fresh ripe peach day idea bite juicy ripe peach tangy flavor make mouth water fully mature peach pick day spoil fond memory join mother sibling kitchen preserve harvest peach come winter seal bottle preserve peach correctly delicious fruit year day properly prepare heat fruit preserve seal break christ direct bring forth fruit fruit remain wasn t speak peach talk god s blessing child covenant god blessing associate covenant extend life seal preserve forever fruit remain eternity holy ghost divine role holy spirit promise seal ordinance faithful covenant valid mortality have holy ghost seal ordinance essential want promise blessing eternity fruit remain particularly important want exalt president russell m nelson teach begin end mind surely end like achieve live forever family exalted state presence god heavenly father son jesus christ president nelson say celestial marriage pivotal preparation eternal life require married right person right place right authority obey sacred covenant faithfully assure exaltation celestial kingdom god blessing exaltation include dwell god s presence eternity husband wife inherit throne kingdom principality power continuation seed forever receive god father lord reveal joseph smith celestial glory heaven degree order obtain high man enter order priesthood mean new everlasting covenant marriage obtain enter end kingdom increase learn celestial kingdom dwell presence god single exalt high degree celestial kingdom enter marriage proper authority true covenant marriage faithful covenant holy spirit promise seal marriage covenant sealed blessing fruit remain require faithfully new everlasting covenant marriage president russell m nelson teach type bond enter eternal marriage covenant lateral bond husband wife vertical bond god blessing exaltation seal remain life true lateral vertical bond covenant lateral bond spouse god counsel love wife husband heart cleave unto married cleave unto mean counsel love love care prioritize time spouse outside interest god help overcome weakness mean emotional intimacy sexual relation kind outside marriage include flirt date pornography engender lust lateral bond covenant partner desire marriage president dallin h oak recently teach know god force sealing relationship blessing seal relationship assure covenant force seal relationship person unworthy unwilling vertical bond refer president nelson vertical bond god vertical bond god true temple covenant law obedience sacrifice gospel chastity consecration covenant god receive eternal companion righteous spouse parent vertical bond qualify blessing family god abrahamic covenant include blessing posterity gospel priesthood blessing fruit remain hope enter new everlasting covenant remain true blessing seal eternity ideal reach ministry encounter member covenant spouse single have opportunity marry mortality faithful marriage covenant happen individual circumstance remain faithful covenant endow receive personal blessing promise endowment spouse break covenant withdraw marriage seal later divorced sealing cancel personal blessing sealing remain effect remain faithful feeling betrayal real hurt faithful spouse want cancel sealing unfaithful spouse far away possible earth eternity concerned tie unrepentant spouse remember god require remain seal relationship eternity heavenly father ensure receive blessing desire choice allow cancellation sealing desire agency respect certain procedure follow casually presidency hold key bind earth heaven sealing cancellation grant presidency blessing relate sealing long force cancel laterally vertically important understand receive blessing exaltation demonstrate willing enter faithfully new everlasting covenant life single member church remember lord s way time blessing withhold faithful saint lord judge reward individual accord heartfelt desire deed remain faithful temple covenant hope yes gospel jesus christ gospel hope hope come jesus christ sincere repentance obediently follow christ s teaching see individual grave mistake break sacred covenant regular basis sincerely repent forgive return covenant path break temple covenant urge turn jesus christ counsel bishop repent open soul mighty healing power available atonement jesus christ brother sister love heavenly father give covenant access store sacred blessing god delicious earthly fruit preserve forever fruit remain faithful covenant testify god restore authority bind earth heaven authority find church jesus christ day saint hold presidency quorum exercise direction president russell m nelson enter new everlasting covenant marriage covenant perfect eventually receive fulness glory father regardless circumstance control promise blessing appertain covenant seal holy spirit promise fruit remain forever testify jesus christ amen note john dale g renlund access god s power covenant liahona doctrine covenant ordinance seal valid heaven earth perform have authority ratify holy ghost tend think sealing authority apply certain temple ordinance authority necessary ordinance valid bind death sealing power confer seal legitimacy baptism example recognize heaven ultimately priesthood ordinance perform key president church president joseph fielding smith explain president church give authority sealing power priesthood hold key quote harold b lee conference report oct d todd christofferson sealing power liahona nov act seal holy spirit promise ratify holy ghost approve lord lie holy ghost undetected principle apply ordinance performance church party marriage true doctrine covenant worthy ratifying seal place temple marriage unworthy justify spirit ratification holy ghost withhold subsequent worthiness seal force unrighteousness break seal bruce r mcconkie holy spirit promise prepare eternal marriage student manual holy spirit promise holy ghost place stamp approval ordinance baptism confirmation ordination marriage promise blessing receive faithfulness person violate covenant baptism ordination marriage spirit withdraw stamp approval blessing receive ordinance seal promise reward base faithfulness holy spirit withdraw stamp approval covenant break joseph field smith doctrine salvation comp bruce r mcconkie russell m nelson heart matter year living teach covenant seal holy spirit promise force resurrection dead doctrine covenant russell m nelson celestial marriage ensign liahona nov doctrine covenant doctrine covenant doctrine covenant doctrine covenant high destination exaltation celestial kingdom focus church jesus christ day saint dallin h oak kingdom glory liahona nov marriage family share unique lateral bond create special love new relationship form bind covenant vertically god enter new everlasting covenant marriage russell m nelson heart matter doctrine covenant general handbook serve church jesus christ day saint discuss marriage refer marriage accord god s law define marriage legal lawful union man woman family proclamation world gospel library family proclamation world gospel library doctrine covenant dallin h oak kingdom glory emphasis add doctrine covenant abraham general handbook serve time mission switzerland companion share gospel wonderful year old swiss couple teach couple restore church jesus christ woman show great interest teach week gain testimony reality church jesus christ restore correct authority god jesus christ direct church live prophet apostle look forward teach couple sublime doctrine restoration opportunity eternal marriage surprisingly teach couple doctrine eternal marriage swiss woman remark interest husband eternity heaven include husband marry year sister baptize husband seal temple heaven heaven person married spouse love forever truly sound like heaven eld jeffrey r holland share dear beloved wife pat heaven heaven scott taylor elder holland heaven wife child wouldn t heaven church news july thechurchnews com dallin h oak kingdom glory russell m nelson celestial marriage john","17":"high joya high joyapril general conference high joy elder dieter f uchtdorf quorum apostle seek find high joy come devote life heavenly father beloved son great blessing speak general conference decade time ask question relate message world lately particular question keep come usually go like elder uchtdorf listen carefully talk didn t hear aviation today hear question tumbling mirth sun split cloud s hard believe year ago wilbur orville wright lift fly sand kitty hawk north carolina short flight december day change world open door great invention world s history fly risky early day brother know father milton fact terrified lose son fly accident promise fly exception seven year historic day kitty hawk milton wright finally give consent watch wilbur orville fly time land orville convince father flight like plane lift ground year old milton get catch exhilaration flight fear leave orville rejoice father shout delight high orville high man heart reason speak aviation occasionally know wright feel slip surly bond earth dance sky laughter silver wing wright brother flight happen mere year birth open door adventure wonder pure joy life amazing joy high kind joy today spirit milton wright s delighted cry high orville high like speak high joy come enter heart experience great measure aim human existence probably go say want happy go say happy sadly people happiness hard find happiness thing human desire unsuccessful find paraphrase country song maybe ve look joy wrong place find happiness discuss find joy allow acknowledge depression difficult mental emotional challenge real answer simply try happy purpose today diminish trivialize mental health issue face challenge mourn stand people find joy include seek help train mental health professional devote life practice important art thankful help life endless sequence emotional high need opposition thing god weep scripture affirm course weep feel sad sign failure life joy sorrow inseparable companion like feel share disappointment sorrow sadness remorse experience glorious dawn fill soul joy profound scarcely keep discover peaceful confidence come follow savior walk way peace give like world give s well s high holy jesus say come life abundantly gospel jesus christ truly good news great joy message matchless hope message yoke bearing burden lifting light gathering heavenly favor high understand holy covenant eternal security everlasting glory joy purpose god s plan child s create joy build father heaven hide path happiness secret available promise walk path discipleship follow teaching example savior commandment honor covenant god remarkable promise god offer know people don t need god happy happy religion acknowledge respect feeling beloved father heaven want child happiness possible fill world beautiful wholesome pleasure delight eye gladden heart fly bring great happiness find music art hobby nature invite share savior s good news great joy discount source joy simply say god high profound joy joy transcend world offer joy endure heartbreak penetrate sorrow diminish loneliness worldly happiness contrast nature earthly thing grow old decay wear stale godly joy eternal god eternal jesus christ come lift temporal replace corruption incorruption power joy perpetual feel kind joy life invite embark journey follow jesus christ way journey lifetime let suggest begin step worthy journey discover pure joy draw near unto god remember woman new testament endure bleed illness year spend physician thing grow bad hear jesus power heal known heal near sickness unclean accord law moses require stay away approach openly ask healing question think touch clothe shall faith overcome fear brave censure press savior finally reach extend hand heal aren t somewhat like woman reason hesitate draw near savior face ridicule condemnation pride dismiss possibility simple value think condition disqualify healing distance great sin like woman learn draw near god reach touch find heal peace joy look jesus teach seek ye shall find believe simple phrase spiritual promise statement fact seek reason angry doubt bitter find seek joy look reason rejoice happily follow savior find rarely find look look joy seek ye shall find bear s burden jesus teach blessed receive search joy good way find bring joy brother sister know know true joy like barrel flour jar oil run true joy multiplie share doesn t require grand complicated simple thing like pray heart give sincere compliment help feel welcome respect value love share favorite scripture mean listen ye service fellow being ye service god god repay kindness generously joy return good measure press shake run shall come day week month invite spend time sincere hearted effort draw near god seek diligently everyday moment hope peace joy bring joy dear brother sister dear friend search word god deep understanding god s eternal plan accept invitation strive walk way experience peace god passeth understand midst sorrow feel great measure god s unsurpassable love swell heart dawn celestial light penetrate shadow trial begin taste unspeakable glory wonder unseen perfect heavenly sphere feel spirit lift away gravity world like good milton wright raise voice rejoicing shout high father high seek find high joy come devote life heavenly father beloved son earnest prayer blessing sacred jesus christ amen note john gillespie magee jr high flight poetryfoundation org christopher klein thing know wright brother history mar history com magee high flight year ago aristotle observe happiness thing human desire treatise nicomachean ethic teach great good life thing pursue end oppose thing pursue means end happiness thing desire happiness sake say means nicomachean ethic aristotle trans j e c weldon harry enten american happiness hit record low cnn feb cnn com tamara lush poll americans unhappy ve year associated press june apnews com great gloom employee unhappy bamboohr bamboohr com wanda mallette patti ryan bob morrison lookin love wrong place nephi john moses nephi john john luke new revise standard version matthew nephi concern father heaven accept allow receive joy invite prayerfully read christ s parable prodigal son luke parable learn heavenly father feel child await celebrate return stray moment come verse begin journey home stand watch wait wait draw near celebrate return child doctrine covenant revelation explain pleaseth god hath give thing unto man unto end verse draw near god give grand promise draw near unto doctrine covenant james mark bible dictionary clean unclean mark matthew bear s burden fulfil law christ galatians mosiah act king mosiah epistle romans paul state god render man accord deed patient continuance seek glory honour immortality eternal life glory honour peace man worketh good romans luke salvation eternal happiness depend compassion kindness matthew luke philippian","18":"word matterword matterapril general conference word matter eld ronald rasband quorum apostle word set tone voice thought feeling experience good bad brother sister friend world honor address vast audience member church friend new listener conference broadcast welcome message share pulpit communicate word give english translate nearly different language base word word matter lot let word matter bedrock connect represent belief moral perspective speak word time listen word set tone voice thought feeling experience good bad unfortunately word thoughtless hasty hurtful say wound punish cut lead destructive action weigh heavily hand word celebrate victory hopeful encourage prompt rethink reboot redirect course word open mind truth foremost lord s word matter book mormon prophet alma people ancient america encounter endless warfare disregard word god harden heart corrupt culture faithful fight alma counsel preaching word great tendency lead people yea powerful effect mind people sword happen unto alma think expedient try virtue word god word god surpass expression creation earth lord speak let light light savior come assurance new testament heaven earth shall pass away word shall pass away man love word father love come unto abode mary mother jesus come humble testimony behold handmaid lord unto accord thy word believe heed word god draw close president russell m nelson promise study word ability like increase don t want hymn say blessed holy savior like thee picture young joseph smith knee hear word father heaven joseph beloved son hear hear word scripture let sit page recognize speak change hear personal revelation prompting holy ghost answer prayer moment jesus christ power atonement lift burden grant forgiveness peace embrace arm love second word prophet matter prophet testify divinity jesus christ teach gospel love bear witness live prophet president russell m nelson hear speak word lord president nelson way word say covenant path gather israel let god prevail build bridge understanding thank increase faith jesus christ charge testimony peacemaker recently ask think celestial confront dilemma say think celestial test temptation think celestial life love one let think celestial dies prematurely think celestial pressure life crowd think celestial think celestial heart gradually change view trial opposition new light faith increase think celestial thing world burden confusion contention need perspective eld george albert smith long president church speak sustain prophet heed word say obligation raise hand sacred mean stand pray strive carry instruction lord shall direct word diligently act prophet s word prophet seer revelator sustain yesterday worldwide church want share experience sustain prophet embrace word like prophet jacob recount hear voice lord speak unto word imageelder sister rasband thailand october wife melanie bangkok thailand prepare dedicate church s th temple assignment surreal humble temple southeast asia peninsula masterfully design story spired structure fitly frame house lord month contemplate dedication settle soul mind country temple cradle arm prophet apostle president thomas s monson announce temple president nelson dedication imagebangkok thailand temple prepare dedicatory prayer month early sacred word translate language ready think night dedication awaken sleep unsettled urgent feeling dedicatory prayer try set aside prompting think prayer place spirit leave sense certain word miss divine design come revelation insert word prayer near end think celestial let thy spirit prevail life strive peacemaker lord remind heed word live prophet think celestial let spirit prevail strive peacemaker word prophet matter lord important word believe emoji fill world word matter word supportive angry joyful mean compassionate toss aside heat moment word sting sink painfully deep soul stay word internet texting social medium tweet life careful family especially husband wife child word bring drive wedge let suggest simple phrase use sting difficulty difference lift reassure thank sorry love save humble phrase special event catastrophe use sincerely regard talk grow cheap follow pattern thank elevator parking lot market office queue neighbor friend sorry mistake miss meeting forget birthday pain love word carry message think care let share personal example husband heed sister go help time assignment church travel widely company go fair time far reach world end day matter call home wife melanie pick phone report conversation lead express love day word serve anchor soul conduct protection evil design melanie love speak precious trust president thomas s monson foot steady hand grasp mind encourage heart inspire soul save say thank sorry love brother sister word matter promise feast word christ lead salvation prophet s word guide encourage word speak hold dear power heaven pour word christ tell thing ye heavenly father s child god expect speak tongue angel power holy ghost love lord jesus christ word old testament prophet isaiah wonderful counsellor mighty god everlasting father prince peace apostle john clear jesus christ word testify apostle call lord s divine service declare word call stand special witness lord jesus christ amen note alma genesis matthew john luke russell m nelson study scripture savior week little learn inspiration blog feb churchofjesuschrist org holiness hymn joseph smith history prophet lehi describe arm love declaration son behold lord hath redeem soul hell behold glory encircled eternally arm love nephi president russell m nelson say prophet testify jesus christ divinity earthly mission ministry sustain prophet ensign liahona nov russell m nelson forward ensign liahona apr russell m nelson hope israel worldwide youth devotional june gospel library russell m nelson let god prevail liahona nov russell m nelson president nelson share social post racism call respect human dignity june newsroom churchofjesuschrist org russell m nelson sarah jane weaver president nelson invite givethanks church news nov thechurchnews com russell m nelson overcome world find rest liahona nov russell m nelson choice eternity worldwide devotional young adult gospel library russell m nelson peacemaker need liahona facebook com reel russell m nelson think celestial liahona nov jacob teaching president church george albert smith jacob bangkok thailand temple dedicate october temple district reach thailand s border span cambodia pakistan nepal indonesia ephesians thomas s monson blessing temple ensign liahona news temple nation mar newsroom churchofjesuschrist org dedicatory prayer bangkok thailand temple temples churchofjesuschrist org emoji little yellow face pictogram embed electronic message convey feeling expression idea thomas s monson rescue ensign liahona july nephi nephi nephi nephi write man speaketh power holy ghost power holy ghost carrieth unto heart child man nephi isaiah john","19":"pray therepray thereapril general conference pray president susan h porter primary general president invite pray know heavenly father pray grow like pray love brother sister feel joy respond impression speak child girl boy world want share heavenly father love child know want bless pray heart feel love like receive gift want talk special gift heavenly father give help gift prayer blessing prayer talk heavenly father anytime imagejesus child jesus earth teach pray say ask ye shall receive gift pray today want share pray know pray grow pray let s talk pray know need know song prayer primary child sing world start question know song brave sing heavenly father hear answer ev ry child s prayer know heavenly father t president russell m nelson invite pour heart heavenly father listen listen feel heart thought come mind heavenly father glorify body flesh bone father spirit heavenly father power know thing child hear answer prayer come know love know heavenly father real love live courage hope pray speak list ning feel day granddaughter ashley year old friend play school playground stand feel unimportant unseen specific thought come mind wait m christ ashley knelt right middle playground fold arm pray heavenly father moment open eye girl age stand ask want play ashley come know important lord truly want know hard happen life didn t receive blessing pray good question ask heavenly father remember nephi family hungry travel wilderness nephi brother go hunt food nephi break bow didn t ask imagenephi ask lehi find food nephi new bow ask father lehi food lehi pray lord show nephi heavenly father guide ask learn second pray grow heavenly father want help grow love send son jesus christ way live jesus suffer die resurrect forgive sin grow like want grow patience honesty want grow skill maybe shy want grow courage pray spirit heart change receive strength new friend jonah write feel nervous way school morning worry thing like late forget take test start say prayer drive school mom ask help need pray family think thing m grateful pray heavenly father help don t feel relief right car time m classroom feel peaceful jonah s faith grow pray day move forward pray pray help heavenly father s love spirit heavenly father help notice sad comfort help love forgive courage serve share child god help come know love jesus heavenly father life pray father member church jesus christ day saint young girl know blessing receive family receive blessing seal eternity family friend pray didn t join church heavenly father force choice send answer prayer way imagepresident porter parent sibling old receive patriarchal blessing blessing patriarch tell good thing help family heaven example gospel jesus christ s father live day die receive sacred feeling joy heavenly father let know spirit father want receive blessing gospel jesus christ forget day knelt altar temple sister brother seal parent start pray blessing primary receive grandmother pray blessing family love don t heavenly father share heavenly father heart sincerely ask help receive spirit guide pray day fill love heavenly father jesus christ help want follow life imagine happen child africa south america asia europe north america australia pray day world bless god s love imagechildren world pray invite pray know heavenly father pray grow like pray love know live love pray sacred jesus christ amen note john nephi child s prayer child s songbook russell m nelson revelation church revelation life ensign liahona doctrine covenant moses child s prayer nephi john child s prayer personal correspondence john alma nephi helaman mosiah alma doctrine covenant","20":"powerful virtuous cycle doctrine christthe powerful virtuous cycle doctrine christapril general conference powerful virtuous cycle doctrine christ elder dale g renlund quorum apostle invite live doctrine christ repeatedly iteratively intentionally help way year ago wife ruth daughter ashley join tourist kayaking excursion state hawaii united states kayak low water canoe like boat rower sit face forward use double bladed paddle pull plan row small island coast oahu confident young man paddle kayak mountain lake hubris bode guide give instruction show ocean kayak use differ one previously paddle suppose sit kayak instead inside get kayak center gravity high accustomed stable water start row fast ruth ashley far ahead proud heroic pace stop paddle wait catch large wave centimeter hit kayak flip water time turn kayak upright struggle ruth ashley pass wind resume paddle catch breath wave truly enormous centimeter hit kayak flip time manage right kayak breath fear able climb see situation guide row steady kayak make easy climb see breathless row hitch towrope kayak begin paddle pull soon catch breath begin paddle adequately let rope reach island assistance arrival flop sand exhaust group rest guide quietly say mr renlund paddle maintain momentum think go fine follow advice paddle second island starting point twice guide row tell great large wave hit kayak flip consistently paddle kayak maintain momentum forward progress mitigate effect wave hit principle apply spiritual life vulnerable slow especially stop maintain spiritual momentum continually row savior safe secure eternal life depend faith spiritual momentum create lifetime repeatedly embrace doctrine christ president russell m nelson teach produce powerful virtuous cycle element doctrine christ faith lord jesus christ repentance enter covenant relationship lord baptism receive gift holy ghost endure end intend experience time check box event particular enduring end separate step doctrine christ complete element hunker grit tooth wait die enduring end repeatedly iteratively apply element doctrine christ create powerful virtuous cycle president nelson describe repeatedly mean experience element doctrine christ life iteratively mean build improve repetition repeat element spin circle forward trajectory instead draw close jesus christ time cycle momentum involve speed direction paddle kayak vigorously wrong direction create significant momentum reach intend destination similarly life need row savior come unto faith jesus christ need nourish daily nourish pray daily study scripture daily reflect goodness god daily repent daily follow prompting holy ghost daily healthy defer eat food sunday binge weekly allotment nutrition spiritually healthy restrict testimony nourish behavior day week assume responsibility testimony gain spiritual momentum gradually develop bedrock faith jesus christ doctrine christ central purpose life momentum likewise build strive obey law god repent repentance joyful allow learn mistake progress eternally undoubtedly time flip kayak find deep water repentance continue matter time fall important element doctrine christ baptism include baptism water confirmation baptism holy ghost baptism singular event renew baptismal covenant repeatedly partake sacrament sacrament replace baptism link initial element doctrine christ faith repentance reception holy ghost conscientiously partake sacrament invite holy ghost life like baptize confirm covenant describe sacrament prayer holy ghost companion holy ghost exert great influence life progressively iteratively develop christlike attribute heart change disposition evil diminish inclination good increase want good continually access heavenly power need endure end faith increase ready repeat powerful virtuous cycle forward spiritual momentum propel additional covenant god house lord multiple covenant draw close christ connect strongly covenant great access power clear baptismal temple covenant source power source power lord jesus christ heavenly father make keeping covenant create conduit power life live accord covenant eventually inheritor heavenly father momentum produce live doctrine christ power transformation divine nature eternal destiny motivate help appropriate way consider expedition guide help flip kayak shout afar unhelpful question mr renlund water paddle chide say mr renlund situation physically fit start tow kayak try correct group instead give help need time need give advice receptive go way encourage minister need ask unhelpful question state obvious people struggle know struggle judgmental judgment helpful welcome ill informed compare lead pernicious error especially conclude righteous struggle comparison like drown hopelessly meter water see drown meter water judge great sinner feel good struggle way earn salvation jacob book mormon teach remember reconcile unto god grace god save need savior s infinite atonement need compassion empathy love interact struggle need experience pure love jesus christ reflect word action minister encourage frequently offer help receptive continue minister allow savior teach unto shall ye continue minister ye know return repent come unto purpose heart shall heal ye shall mean bring salvation unto savior s job heal job love love minister way draw jesus christ fruit powerful virtuous cycle doctrine christ invite live doctrine christ repeatedly iteratively intentionally help way testify doctrine christ central heavenly father s plan doctrine exercise faith jesus christ atonement propel covenant path motivate help faithful disciple jesus christ heir heavenly father s kingdom culmination faithfully live doctrine christ jesus christ amen note inch inch physics momentum mass velocity stop velocity zero product mass velocity zero regardless prior momentum mass russell m nelson power spiritual momentum liahona president nelson counsel need positive spiritual momentum s good way forward amid fear uncertainty nephi russell m nelson overcome world find rest liahona nov russell m nelson overcome world phrase doctrine christ mean phrase gospel jesus christ nephi nephi disengage element doctrine christ slow stop spiritual momentum nephi alma doctrine covenant physics momentum mass velocity velocity speed combination direction motion object velocity vector inherently directional nephi russell m nelson power spiritual momentum colossian russell m nelson overcome world underline importance testimony maintain spiritual momentum statement president nelson charge testimony quote president m russell ballard follow jesus christ footstep faith liahona nov elder quentin l cook true god work liahona nov restoration fulness gospel jesus christ bicentennial proclamation world gospel library russell m nelson plea sister ensign liahona nov mosiah alma moroni doctrine covenant nephi eld james e talmage write course study principle ordinance gospel specify fourth article faith subject sacrament lord s supper properly claim attention observance ordinance require member church christ compliance requirement faith repentance baptism water holy ghost article faith th ed doctrine covenant dallin h oak special witness christ ensign apr liahona apr mosiah instance nephi nephi moroni doctrine covenant doctrine covenant foot foot ephesian nephi president jeffrey r holland teach batter weary swimmer try valiantly shore having fight strong wind rough wave challenge place well judgment well luck ought row beat oar shove head underwater s boat robe ring fat calf brigham young university devotional jan speech byu edu russell m nelson peacemaker need liahona nephi","21":"trust lordtrust lordapril general conference trust lord elder paul b pieper seventy relationship god grow degree willing place trust family play game crazy trust exercise play people stand foot apart signal person person fall backward wait arm friend trust foundation relationship threshold question relationship trust person relationship form people willing place trust relationship person trust completely beloved spirit son daughter loving heavenly father spiritual genealogy provide foundation create meaningful relationship god relationship build choose trust heavenly father desire build close personal relationship spirit child jesus express desire pray thou father art thee relationship god seek spirit child close personal able share kind deep endure relationship develop build perfect total trust heavenly father work beginning communicate absolute trust divine potential child trust underlie plan present growth progression prior come earth teach eternal law create earth provide mortal body gift choose permit learn grow make choice want choose follow law return enjoy eternal life son know good choice prepare way escape consequence bad choice provide savior son jesus christ atone sin clean condition repentance invite use precious gift repentance regularly parent know difficult trust child let decision especially parent know child likely mistake suffer result heavenly father allow choice help reach divine potential elder dale g renlund teach goal parenting child right child choose right ultimately like notwithstanding god s trust relationship grow degree willing place trust challenge live fall world experience betrayal trust result dishonesty manipulation coercion circumstance betray struggle trust negative trust experience imperfect mortal impact willingness trust perfect heavenly father year ago friend leonid valentina express interest member church leonid begin learn gospel find difficult pray early life leonid suffer manipulation control superior develop distrust authority experience affect ability open heart express personal feeling heavenly father time study leonid gain well understanding god s character experience feel god s love eventually prayer natural way express thank love feel god increase trust god eventually lead valentina enter sacred covenant strengthen relationship god prior loss trust keep trust god follow leonid s example patiently continue learn heavenly father character attribute purpose look record experience feel love power life live prophet president russell m nelson teach learn god easy trust good way learn trust god simply trust like crazy trust exercise need willing fall backward let catch mortal life test challenge stretch capacity come frequently knowledge understanding inadequate naturally look resource help information saturate world shortage source promote solution challenge simple time test counsel proverb provide good advice trust lord thine heart trust god turn confront life s challenge finish law school utah family face important decision work home counsel lord feel direct family eastern united states far parent sibling initially thing go feel confirm decision thing change downsize law firm face prospect job insurance time daughter dora bear medical challenge long term special need confront challenge extend serve require significant time commitment face challenge overwhelmed begin question decision accompany confirmation trust lord thing suppose work fall backward appear go catch day word don t ask ask want learn come distinctly mind heart confused moment struggle early decision god invite trust look critical point life moment realize good way learn trust god simply trust subsequent week watch amazement lord miraculously unfold plan bless family good teacher coach know intellectual growth physical strength happen mind muscle stretch likewise god invite grow trust spiritual tutoring soul stretch experience sure trust demonstrate god past trust stretch experience lie ahead god focus growth progress master teacher complete coach stretch help realize divine potential include future invitation trust little bit book mormon teach pattern god use stretch order build strong relationship come follow recently study nephi s trust god test brother command return jerusalem obtain brass plate initial attempt fail brother give ready return plate nephi choose place complete trust lord successful obtain plate experience likely strengthen nephi s confidence god bow break family face starvation wilderness nephi choose trust god family save successive experience give nephi strong confidence god enormous trust stretch task soon face build ship experience nephi strengthen relationship god consistently continuously trust god use pattern extend personal invitation strengthen deepen trust time accept act invitation trust god grow ignore decline invitation progress stop ready act new invitation good news regardless trust choose place god past choose trust god today day go forward promise time god catch relationship trust grow strong strong day son declare like nephi o lord trust thee trust thee forever jesus christ amen note family proclamation world gospel library doctrine covenant john doctrine covenant alma liberate ennobling crucial individual progression regular daily focus repentance repentance event process russell m nelson well well ensign liahona dale g renlund choose day ensign liahona nov russell m nelson christ rise faith mountain liahona proverb nephi nephi nephi god s personal invitation come read scripture live prophet whispering holy ghost nephi","22":"god s intent bring homegod s intent bring homeapril general conference god s intent bring home eld patrick kearon quorum apostle father s plan beloved child design bring home like express gratitude prayer start process adjust president nelson serve apostle lord jesus christ probably imagine humble feel time extraordinary upheaval sober self examination great honour serve saviour capacity engage share good news gospel hope say new apostle stand astonished mother law don t know actually say case certainly suspect fact mother law long reduce astonishment month ago wife visit country church assignment wake early morning look blearily outside hotel window busy street see roadblock set policeman station nearby turn car reach barrier car travel road turn time go traffic increase queue car begin build window watch policeman satisfaction power block flow traffic turn people away fact develop spring step start little jig car approach barrier driver get frustrate roadblock policeman appear helpful sympathetic shake head repeatedly point opposite direction friend fellow disciple road mortal life father s beautiful plan fabulous plan design bring home build roadblock station turn send away fact exact opposite god relentless pursuit want child choose return employ possible measure bring love father oversee creation earth express purpose provide opportunity stretching refining experience mortality chance use god give moral agency choose learn grow mistake repent love god neighbour day return home send precious beloved son fall world live range human experience provide example rest child follow atone redeem christ s great atone gift remove roadblock physical spiritual death separate eternal home father s plan beloved child design bring home god s messenger prophet plan restoration scripture plan redemption plan mercy great plan happiness plan salvation unto blood begotten intent father s great plan happiness happiness right right eternity prevent happiness cause instead worry fear intent father s plan redemption fact redemption rescue suffering death jesus christ free captivity sin death leave intent father s plan mercy extend mercy turn honour covenant fidelity deny mercy inflict pain sorrow intent father s plan salvation fact salvation celestial kingdom glory receive testimony jesus offer soul mean go regard live life way choose use agency doesn t matter leave god s commandment course surely jesus s consistent invitation plea mortal ministry change repent come unto fundamentally implicit teaching live high plane moral conduct personal progression transformative faith christ mighty change heart god want radical reorientation selfish prideful impulse eviction natural man sin believe intent father s reach plan save redeem extend mercy bring happiness intent son great plan bring son tell come heaven send jesus s benevolent father s want possible father s child receive end goal plan eternal life exclude divine potential prone worry measure love reach christ s infinite atonement mercifully cover misunderstand infinite mean infinite infinite cover love nephi explain beautiful truth doeth save benefit world loveth world layeth life draw man unto wherefore commandeth shall partake salvation saviour good shepherd go search lose sheep find willing perish arm mercy extend whosoever come receive ye sick bring hither ye lame blind halt maim leprous withered deaf afflict manner bring hither heal compassion cast away woman issue blood recoil leper reject woman take adultery refuse penitent matter sin refuse love bring break heart contrite spirit intent design plan purpose wish hope roadblock barrier remove welcome entire ministry live declaration intent course atone sacrifice hard understand mortal capacity comprehend important understand comprehend holy saving intent atone sacrifice veil temple rent twain jesus die cross symbolise access presence father rip wide open turn trust cast burden yoke covenant bond word father s plan roadblock thing need commandment aspect nature change yes grace reach grasp good news unspeakably grateful simple truth father s design plan purpose intent wish hope heal peace bring love home witness jesus christ son amen notes russell m nelson think celestial liahona nov nephi general handbook serve church jesus christ day saint gospel library moses jacob alma alma alma moses doctrine covenant doctrine covenant omni matthew matthew example matthew savior teach disciple love thy neighbour hate thine enemy follow need love enemy mosiah order mercy jesus christ able come play life turn alma young teach glorious plan redemption bring condition repentance condition mercy effect alma mosiah john john russell m nelson atonement ensign nov atonement infinite end infinite humankind save end death infinite term immense suffering infinite time put end precede prototype animal sacrifice infinite scope mercy atonement extend infinite number people infinite number world create infinite human scale measurement mortal comprehension nephi luke peter doctrine covenant nephi nephi verse jesus christ s teaching indicate individual inherit kingdom heaven make clear outcome desire result choice matthew matthew hebrews","23":"swallow joy christswallowe joy christapril general conference swallow joy christ eld brian k taylor seventy testify heavenly father hear tearful pleading respond perfect wisdom love eld kearon borrow accent minute yearn miracle new testament learn blind bartimaeus cry jesus desire miracle jesus say unto thy way thy faith hath thee immediately receive sight occasion man bethsaida long healing contrast miracle come instantly jesus bless twice restore example apostle paul beseech lord thrice affliction knowledge earnest supplication grant different people unique experience question receive yearned miracle quickly patiently endure wait lord know gratefully know loveth doeth thing welfare happiness divine purpose god see end begin reassure thine adversity thine affliction shall small moment shall consecrate thy gain help find meaning trial elder orson f whitney teach pain suffer trial experience waste minister education patiently endure build character purify heart expand soul make tender charitable sorrow suffer toil tribulation gain education come acquire like heavenly parent understand power christ rest affliction apostle paul say humbly weak strong life s trial prove savior learn obedience perfect suffering day compassionately declare behold refine thee choose thee furnace affliction come trust god s divine purpose breathe hope weary soul kindle determination season anguish heartache divine perspective year ago president russell m nelson share valuable insight look thing eternal perspective significantly lighten load imageholly trey porter wife jill recently witness truth faithful life holly rick porter year old son trey pass away tragic fire hand foot severely burn heroic attempt save dear son holly later testify ward sacrament meeting great peace joy lord pour family anguish word miraculous incredible amazing imageclaspe healing hand precious mother s unbearable grief replace surpass peace thought hand hand save hand belong savior instead look scar reminder able remember scar savior bear holly s witness fulfill prophet s promise think celestial view trial opposition new light eld d todd christofferson state believe challenge overcome grow adversity appeal god present plan redemption premortal world approach challenge know heavenly father sustain crucial turn god dark experience suffering adversity tend despondency despair bitterness divine principle avoid darkness discontent instead find great peace hope joy life s difficult challenge share divine principle invitation strong faith come put jesus christ look unto thought declare doubt fear president nelson teach eternal life dependent faith christ atonement wrestle intense pain cause recent injury feel deep appreciation jesus christ incomprehensible gift atonement think savior suffer pain affliction temptation kind comfort heal rescue time need continue injury cause reflect greatness holy israel healing lord manifest divine power peaceful unmistakable way world ye shall tribulation good cheer savior encourage overcome world bright hope come envision eternal destiny speak power inherent keep vision father s incredible promise blessing eye day sister linda reeve testify know trial personal feeling reward great joyful understanding day reward feel merciful love father require matter suffer end trial qualify eternal life kingdom god president nelson share insight consider lord s response joseph smith plead relief liberty jail lord teach prophet inhumane treatment experience good thou endure lord promise god shall exalt thee high lord teach joseph think celestial envision eternal reward focus excruciate difficulty day joseph s change perspective bring deepening sanctification reflect letter friend having inclose wall prison month heart tender think feel suffer wrong suffer great power come focus joy eternity s crucial agonizing hour savior shrink partook bitter cup learn joy set christ endure cross swallow father imagechrist gethsemane phrase swallow deeply move interest heighten learn spanish swallow translate consume german devour chinese engulf life s challenge painful overwhelming remember lord s promise suffer manner affliction save swallow consume devour engulf joy christ joy defy mortal comprehension bitter cup remove thank keep covenant stand witness god thank reach bless quiet heart hide sorrow eye t bring savior s relief find teach president camille n johnson divine promise return sacrament meeting witness miracle holly porter s family succor lord stand ponder offer comfort remarkable family friend thought come use savior s word close today sabbath word healeth wound soul come unto ye labour heavy laden rest ease burden shoulder feel back bondage ye know surety lord god visit people affliction leave comfortless come witness joyful reverence witness savior live promise sure especially troubled afflict manner testify heavenly father hear tearful pleading respond perfect wisdom god grant unto family time great need burden light swallow joy christ holy jesus christ amen note mark emphasis add mark corinthians emphasis add psalm nephi helaman nephi abraham doctrine covenant nephi orson f whitney teaching president church spencer w kimball corinthian abraham hebrews nephi emphasis add nephi personal conversation elder russell m nelson apr russell m nelson think celestial liahona nov d todd christofferson refining fire affliction liahona mar emphasis add russell m nelson let god prevail ensign liahona nov doctrine covenant russell m nelson think celestial russell m nelson think celestial president jeffrey r holland teach struggle reject spit cast hiss byword stand good life world know pure perfect life live reason stand tall grateful live son live god know sorrow affliction missionary work atonement ensign mar russell m nelson think celestial alma john nephi ether moroni linda s reeve worthy promise blessing ensign liahona nov russell m nelson think celestial joseph smith letter presendia huntington buell mar josephsmithpapers org russell m nelson joy spiritual survival ensign liahona nov mark hebrews mosiah alma psalm john thessalonians joseph smith translation james james footnote nephi alma doctrine covenant moses savior offer peace passeth understand philippian offer intensity depth breadth joy defy human logic mortal comprehension example doesn t possible feel joy child suffer incurable illness lose job spouse betray precisely joy savior offer joy constant assure affliction shall small moment doctrine covenant consecrate gain russell m nelson joy spiritual survival ensign liahona nov mosiah alma year jill meet paula beautiful young guatemalan woman struggle mightily cancer response question feel leave unforgettable memory mind heart grateful humble teenager quietly respond whisper lord give sister feel sister sariah father go minister visit elderly widow great personal need challenge lord follow thee hymn camille n johnson jesus christ relief liahona luke john elder neal maxwell share beautiful insight urge moment stretch particular cross ought foot s empathy proffer spiritual refreshment endure ensign alma dallin h oak teaching jesus christ liahona jacob neil l andersen wound ensign liahona nov matthew matthew lo alway unto end world mosiah john child god children s songbook doctrine covenant nephi alma exodus mosiah nephi mosiah isaiah blessing come soon come late don t come heaven embrace gospel jesus christ come jeffrey r holland high priest good thing come ensign nov alma alma psalm john thessalonians joseph smith translation james james footnote nephi alma doctrine covenant moses","24":"covenant responsibilitiescovenant responsibilitiesapril general conference covenant responsibility president dallin h oak counselor presidency church jesus christ know church emphasize make covenant god church differ answer important question vary mature church grow bear utah church membership cluster utah nearby state time temple today membership church jesus christ day saint number million nation april dedicate temple nation planning construction feel speak purpose temple history role covenant worship supplement inspire teaching early speaker covenant commitment fulfill certain responsibility personal commitment essential regulation individual life functioning society idea currently challenge vocal minority oppose institutional authority insist person free restriction limit individual freedom know millennia experience person individual freedom gain advantage live organize community relinquishment individual freedom principally base commitment covenant express imply imagemilitary personnel imagemedical personnel imagefirefighter imagefull time missionary example covenant responsibility society judge military medical personnel firefighter involve familiar occupation commitment formalize oath covenant perform assign duty true time missionary distinctive clothing tag intend signify wearer covenant duty teach serve support service relate purpose remind wearer covenant responsibility magic distinctive clothing symbol need reminder special responsibility wearer assume true symbol engagement wedding ring role give notice observer remind wearer covenant responsibility imagewedde ring ii say covenant foundation regulation individual life apply particularly religious covenant foundation history religious affiliation requirement base covenant example abrahamic covenant fundamental great religious tradition introduce holy idea god s covenant promise child old testament frequently refer god s covenant abraham seed book mormon write old testament period clearly demonstrate role covenant israelite history worship nephi tell israelite writing period record jews contain covenant lord hath unto house israel book nephi frequent reference abrahamic covenant israel covenant people lord practice covenant god religious leader record book mormon writing nephi joseph egypt king benjamin alma captain moroni iii time come restoration fulness gospel jesus christ god call prophet joseph smith know content angel moroni s early instruction mature young prophet know tell joseph god work fulness everlasting gospel bring forth include promise father know scripture young joseph read intensively direct organize church teaching covenant translate book mormon book restoration s major source fulness gospel include god s plan child book mormon fill reference covenant read bible joseph know book hebrews reference savior s intent new covenant house israel house judah hebrews refer jesus mediator new covenant significantly biblical account savior s mortal ministry title new testament virtual synonym new covenant covenant foundational restoration gospel evident early step lord direct prophet organize church soon book mormon publish lord direct organization restore church soon name church jesus christ day saint revelation record april direct person shall receive baptism church witness mean solemnly testify truly repent sin willing jesus christ have determination serve end revelation direct church meet partake bread wine water remembrance lord jesus importance ordinance evident word covenant specify elder priest officiate bless emblem bread soul partake witness unto thee o god eternal father willing thy son remember commandment give central role covenant newly restore church reaffirm preface lord give publication revelation lord declare call joseph smith inhabitant earth stray ordinance break everlaste covenant revelation explain commandment give everlasting covenant establish today understand role covenant restore church worship member president gordon b hinckley give summary effect baptism weekly partaking sacrament member church enter water baptism party sacred covenant time partake sacrament lord s supper renew covenant remind speaker conference president russell m nelson refer plan salvation covenant path lead god relationship god teach significance covenant temple ceremony urge end beginning think celestial iv speak temple covenant fulfillment responsibility restore fulness gospel jesus christ prophet joseph smith spend final year direct construction temple nauvoo illinois lord reveal sacred teaching doctrine covenant successor administer temple person endow teach god s plan salvation invite sacred covenant live faithful covenant promise eternal life thing theirs shall dwell presence god christ forever endowment ceremony nauvoo temple administer early pioneer expel begin historic trek mountain west testimony pioneer power receive bind christ endowment nauvoo temple give strength epic journey establish west person endow temple responsible wear temple garment article clothing visible wear beneath outer clothing remind endowed member sacred covenant blessing promise holy temple achieve holy purpose instruct wear temple garment continuously exception obviously necessary covenant day remove s garment understand disclaimer covenant responsibility blessing relate contrast person wear garment faithfully temple covenant continually affirm role disciple lord jesus christ imagemap temple church jesus christ day saint construct temple world purpose bless covenant child god temple worship sacred responsibility power unique blessing bind christ receive covenant image o paulo brazil temple church jesus christ know church emphasize make covenant god covenant inherent ordinance salvation exaltation restore church administer ordinance baptism associate covenant requirement entrance celestial kingdom ordinance associated covenant temple requirement exaltation celestial kingdom eternal life great gift god focus church jesus christ day saint testify jesus christ head church invoke blessing seek sacred covenant jesus christ amen note example genesis exodus leviticus nephi nephi nephi nephi example nephi nephi nephi mosiah alma joseph smith history hebrews hebrews description appear doctrine covenant doctrine covenant doctrine covenant mosiah doctrine covenant doctrine covenant doctrine covenant gordon b hinckley god helm ensign russell m nelson forward ensign liahona apr russell m nelson everlasting covenant liahona oct nephi s use metaphor walk path nephi russell m nelson think celestial liahona nov doctrine covenant church history topic nauvoo temple gospel library doctrine covenant","25":"testimony jesusthe testimony jesusapril general conference testimony jesus eld d todd christofferson quorum apostle invitation act secure place valiant testimony jesus joseph smith sidney rigdon receive remarkable vision concern eternal destiny god s child revelation speak heavenly kingdom president dallin h oak speak kingdom glory october note triumph glory lamb relatively individual eventually redeem kingdom accord desire manifest choice god s plan redemption constitute universal opportunity child live earth glory kingdom telestial surpass understand father s hope choose grace son qualify high glorious kingdom celestial enjoy eternal life joint heir christ president russell m nelson urge think celestial make celestial kingdom eternal goal carefully consider decision earth place world celestial kingdom receive testimony jesus man perfect jesus mediator new covenant inhabitant second terrestrial kingdom describe essentially good include honorable man earth blind craftiness man principal limit trait valiant testimony jesus contrast low telestial kingdom receive gospel testimony jesus note distinguish characteristic inhabitant kingdom relate testimony jesus range wholehearted devotion valiant outright rejection person s reaction hang eternal future testimony jesus witness holy spirit divine son god messiah redeemer john s testimony jesus beginning god creator heaven earth gospel gospel life life light man testimony apostle prophet die bury rise day ascend heaven knowledge give salvation cometh testimony give prophet joseph smith live begotten father world create inhabitant thereof beget son daughter unto god ii testimony question inheritor celestial kingdom receive testimony jesus full sense baptize receive holy ghost overcome faith principle truth gospel jesus christ govern priority choice testimony jesus manifest motive charity pure love christ focus pursue measure stature fulness christ find terrestrial kingdom accept testimony jesus distinguish don t valiant witness savior suggest degree apathy casualness lukewarm oppose people ammon book mormon example distinguish zeal god inhabitant telestial kingdom reject testimony jesus gospel covenant prophet describe abinadi having go accord carnal will desire having call lord arm mercy extend arm mercy extend iii mean valiant testimony jesus possibility consider answer question mention valiant testimony jesus surely include nurture strengthen testimony true disciple ignore seemingly small thing sustain strengthen testimony jesus prayer study scripture sabbath observance partaking sacrament repentance minister worship house lord president nelson remind frightening speed testimony nourish daily good word god moroni crumble need daily experience worship lord study gospel add plead let god prevail life fair share time notice happen positive spiritual momentum valiant suggest open public s witness baptism confirm willingness stand witness god time thing place death easter season especially joyfully publicly unreservedly proclaim witness resurrected live christ aspect valiant testimony jesus heed messenger god force well path covenant path instruct prophet fully aware consequence choice member church prophet apostle lovingly plead world heed truth free spare needless suffering bring endure joy valiant testimony jesus mean encourage word example likewise valiant especially family eld neal maxwell address essentially honorable member church skim surface instead deepen discipleship casually engaged anxiously engage doctrine covenant note free choose eld maxwell lament unfortunately choose slackness choose generation small equivocation parent produce large deviation child early generation family reflect dedication current generation evidence equivocation sadly choose dissension erosion take toll year ago elder john h groberg relate story young family live small branch hawaii early s member church year daughter fall ill undiagnosed disease hospitalize church sunday father son prepare sacrament week young father knelt bless bread branch president suddenly realize sacrament table jump cry stop t touch sacrament daughter unknown disease leave immediately fix new sacrament bread t stunned father searchingly look branch president congregation sense depth anxiety embarrassment motion family quietly file chapel word say dejectedly family walk trail small home sit circle father say silent ready speak young son wonder revenge shame suffer kill branch president s pig burn house join church minute pass silence father s clench fist begin relax tear form mother begin cry soon child quietly weep father turn wife say love repeat word child love want forever family way good member church jesus christ day saint seal holy priesthood temple branch president s church church jesus christ allow man hurt embarrassment pride forever sunday church stay daughter s sickness know daughter recover family seal laie hawaii temple complete today soul father grandfather great grandfather bless keep eye eternity aspect valiant testimony jesus mention individual pursuit personal holiness jesus essential redeemer plead repent ye end earth come unto baptize ye sanctify reception holy ghost ye stand spotless day prophet mormon describe group saint persevere manner despite have wade affliction fast pray oft wax strong strong humility firm firm faith christ unto fill soul joy consolation yea purifying sanctification heart sanctification cometh yield heart unto god mighty change heart yield heart god spiritually reborn grace savior seek invitation act secure place valiant testimony jesus repentance need procrastinate day repentance lest hour ye think summer shall past harvest end soul save zealous keep covenant god offend strictness word remember retain christ write heart ye hear know voice ye shall call shall finally settle heart ye thing jesus shall teach command father want child enjoy eternal life celestial kingdom jesus suffer die resurrect possible hath ascend heaven hath sit right hand god claim father right mercy hath child man pray bless burn testimony lord jesus christ rejoice valiant testimony enjoy fruit grace life continually jesus christ amen note dallin h oak kingdom glory liahona nov doctrine covenant dallin h oak kingdom glory doctrine covenant romans russell m nelson think celestial liahona nov doctrine covenant emphasis add doctrine covenant emphasis add doctrine covenant emphasis add joseph smith translation john bible appendix john teaching president church joseph smith mosiah doctrine covenant testimony jesus come holy ghost spirit prophecy revelation revelation teaching joseph smith doctrine covenant moroni ephesian revelation alma mosiah russell m nelson power spiritual momentum liahona mosiah john neal maxwell settle heart ensign nov addition remark elder maxwell general conference speaker recent year address subject include quentin l cook valiant testimony jesus ensign liahona nov rebecca l craven careful versus casual ensign liahona neal maxwell settle heart john h groberg write personal family history ensign hath power give unto father redeem sin repentance hath send angel declare glad tiding condition repentance bringeth unto power redeemer unto salvation soul helaman helaman jesus redeem sin sin nephi verses nephi helaman helaman mosiah alma moses alma doctrine covenant helaman alma mosiah emphasis add joseph smith translation luke luke footnote b moroni","26":"don t fallcall don t fallapril general conference don t fall eld taylor g godoy seventy god testify fall today like begin testify complete certainty heart god hear prayer answer personalized way world go time uncertainty pain disappointment heartbreak feel inclined rely personal ability preference knowledge security come world cause background real source succor support counter challenge mortal life imagehospital room remember occasion hospitalize illness difficult sleep turn light room dark see reflective sign ceiling say don t fall surprise day observe message repeat part room imagecall don t fall sign message important ask nurse say prevent blow increase pain life nature bring painful experience inherent physical body weakness affliction way use agency use agency promise powerful savior declare ask shall give seek ye shall find knock shall open unto prayer mean communication heavenly father allow don t fall circumstance think hear receive immediate response accord expectation lead anxiety sadness disappointment remember nephi s expression faith lord say instruct build ship ask lord instruct fall confidence god s answer imply accept way way thing come pass time certainty know child loving merciful heavenly father motivation devout prayer attitude pray ing faint ing performance welfare soul s imagine feeling heavenly father prayer supplication son jesus christ power tenderness believe display scripture example call god fall helaman army face affliction call god pour soul prayer receive assurance peace faith hope gain courage determination achieve goal imagine moses call cry god find red sea egyptians approach attack abraham obey mandate sacrifice son isaac certain experience call answer fall thirty year ago wife prepare civil marriage temple marriage receive inform civil marriage cancel strike receive day schedule ceremony attempt office find available appointment begin feel distressed doubtful marry plan fianc e call pour soul god prayer finally tell office small town outskirt city acquaintance mayor hesitation go visit ask possible marry joy agree secretary emphasize obtain certificate city deliver document noon day day move small town go police station request require document surprise officer say young couple run away family marry secretly town course case fear sadness overtook remember silently call heavenly father fall receive clear impression mind repeatedly say temple recommend temple recommend immediately take temple recommend hand officer fianc e s bewilderment surprise hear officer didn t tell church jesus christ day saint know church immediately begin prepare document surprised officer leave station say minute pass return morning noon deliver paper suddenly appear beautiful puppy tell wedding gift give document run mayor s office document new dog see official vehicle come stop vehicle stop see secretary inside see say m sorry tell noon errand humble silence call heart heavenly father ask help fall suddenly miracle happen secretary say beautiful dog find like son immediately reply secretary look surprise say ok let s office arrangement day later carol marry civilly plan seal lima peru temple course need remember call matter faith action faith recognize heavenly father answer prayer accord infinite wisdom action consistent ask pray call sign hope take action pray sign faith real faith test moment pain fear disappointment suggest consider following think lord option help don t fall turn god sincere prayer pray obtain blessing pray humble accept answer time way don t stop move forward covenant path wait answer right circumstance feel like fall like like joseph smith cry o god art thou long shall thy hand stay circumstance pray spiritual momentum president russell m nelson teach prayer hear remember hymn ere leave room morning think pray christ savior sue love favor shield today oh pray rest weary prayer change night day life get dark dreary don t forget pray pray feel embrace heavenly father send begotten son relieve burden god testify fall jesus christ amen note matthew nephi isaiah doctrine covenant nephi alma doctrine covenant russell m nelson power spiritual momentum liahona think pray hymn","27":"bridge great commandmentsbridge great commandmentsapril general conference bridge great commandment eld gary e stevenson quorum apostle ability follow jesus christ depend strength power live second commandment balance equal devotion introduction wife lesa travel assignment world relish privilege meet congregation large small devotion work lord buoy stand testimony gospel jesus christ return home trip wonder possibly give receive imagerainbow bridge imagetse ma bridge imagetower bridge travel little time sightseeing possible spend moment particular passion interest architecture design special fascination bridge suspension bridge amaze s rainbow bridge tokyo tse ma bridge hong kong tower bridge london see marvel engineering genius build complicated structure bridge place able continue note message prepare tragic bridge accident occur baltimore mourn loss life offer condolence affect family magnificent suspension bridge recently conference assignment take california cross iconic golden gate bridge regard engineering wonder world monumental structure intertwine beautiful form functional purpose masterful engineering classic suspension bridge bookend tower support massive pier colossal majestic weight bear twin tower soar ocean element construct shoulder load sweeping main suspension cable vertical suspender cable cradle roadway extraordinary stabilizing capacity power tower magic engineering bridge imagegolden gate bridge construction golden gate bridge district early construction image bridge bear testimony engineering principle bridge element find weight bear support symmetrical tower interdependently connect imagegolden gate bridge construction getty image underwood archive bridge complete powerful tower firmly place pier anchor foundation bedrock image strength beauty imagegolden gate bridge today invite look stately bridge ascending twin tower build strong foundation gospel lens twilight jesus christ s ministry holy week pharisee lawyer ask savior question know nearly impossible answer master great commandment law lawyer tempt seek legalistic answer seemingly deceitful intent receive genuine sacred divine response jesus say unto thou shalt love lord thy god thy heart thy soul thy mind great commandment hearkening bridge analogy tower second like unto thou shalt love thy neighbour thyself second tower commandment hang law prophet remain element bridge let s examine great commandment reveal recite jesus christ s response let image magnificent suspension bridge resonate mind s eye love lord love lord heart soul mind answer jesus christ condense essence law embody sacred teaching old testament love lord center heart nature lord ask love soul entire consecrated finally love mind intelligence intellect love god limited finite infinite eternal application great commandment feel abstract daunt gratefully consider word jesus commandment graspable ye love commandment love heavenly father jesus christ lead prayer scripture study temple worship love father son payment tithe keep sabbath day holy live virtuous chaste life obedient love lord measure small daily deed footstep covenant path young people social medium build tear leave party movie activity standard challenge show reverence thing sacred consider tender example fast sunday vance knock door small humble home deacon quorum come expect word come yelled warmly thick german accent loud hear door sister muellar immigrant widow ward couldn t answer door easily legally blind step inside dimly light home greet kind question name love lord answer share come receive fast offering young age meager circumstance readily apparent faith fill response profoundly touch place dime counter early morning grateful offer fast offering kind place envelope fill fast offering receipt love lord lift faith time leave home king benjamin promise remarkable power follow great commandment desire ye consider blessed happy state commandment bless thing hold faithful end receive heaven state end happiness love lord lead eternal happiness love neighbor jesus say second like unto thou shalt love thy neighbour thyself second tower bridge jesus bridge heavenly upward gaze love lord earthly outward gaze love fellow man woman interdependent love lord complete neglect neighbor outward love include god s child regard gender social class race sexuality income age ethnicity seek hurt break marginalize alike unto god succor weak lift hand hang strengthen feeble knee consider example brother evans surprised prompt stop car knock unknown door unknown family widow mother answer door difficult circumstance great need readily apparent simple paint home follow year temporal spiritual minister family thankful mother later write heaven send friend spend life reach love hear thing lord express appreciation good financially spiritually people know thank bless way missionary provide wonder lord pick exclusively listen love neighbor include christlike deed kindness service let grudge forgive enemy welcome minister neighbor assist elderly inspire build tower love neighbor president russell m nelson teach give help make conscientious effort care care joy especially convenient take comfort zone live second great commandment key true disciple jesus christ interdependency jesus teach commandment hang law prophet instructive important interdependency love lord love golden gate bridge perform design function tower equally strong equal power bear weight suspension cable roadway traffic cross bridge engineering symmetry bridge compromise lead collapse suspension bridge build tower function complete harmony likewise ability follow jesus christ depend strength power live second commandment balance equal devotion imagegolden gate bridge increase contention world suggest time fail remember focused keep commandment little tolerance righteous find difficult love choose live life outside covenant away religious participation alternatively emphasize importance love acknowledgment accountable god refuse entirely notion thing absolute truth right wrong believe thing require complete tolerance acceptance choice imbalance cause spiritual bridge tip fall president dallin h oak describe say command love jesus s parable good samaritan teach neighbor zeal second commandment cause forget love god heart soul mind conclusion question build bridge faith devotion erect tall bridge tower love god love neighbor start initial effort look like plan napkin early stage blueprint bridge hope construct consist realistic goal understand lord s gospel vow judge young old begin imagebridge design sketch time prayerful thoughtful planning rough idea refine new action habit early draft polished blueprint build personal spiritual bridge heart mind devote heavenly father begotten son brother sister work play live day ahead pass majestic suspension bridge picture soar tower invite remember great commandment describe jesus christ new testament lord s instruction inspire heart mind lift upward love lord turn outward love neighbor strengthen faith jesus christ atonement testify jesus christ amen note new testament term lawyer equivalent scribe profession student teacher law include write law pentateuch tradition elder matt mark luke bible dictionary lawyer anciently jewish scholar enumerate commandment torah actively debate relative importance versus lawyer intend use jesus s answer say commandment important allow opening accuse jesus ignore aspect law savior s response silence come entrap foundational statement today bedrock church matthew doctrine covenant john name change story protect privacy mosiah matthew nephi doctrine covenant change protect privacy russell m nelson second great commandment ensign liahona nov matthew dallin h oak great commandment ensign liahona nov","28":"opposition thingsopposition thingsapril general conference opposition thing eld mathia hold seventy able exercise agency need oppose option consider recently drive city unknown inadvertently take wrong turn lead wife express highway endless mile able turn receive kind invitation friend s home worry arrive later expect highway desperately look way blame pay well attention navigation system experience cause think life wrong decision live consequence humbly patiently able change course life make choice father heaven give divine gift agency precisely learn choice right one wrong one correct wrong choice repent growth happen heavenly father s plan learn develop progress eternal life wife teach missionary join church year ago impress profound teaching lehi give son jacob book mormon teach lord god give unto man act need opposition thing able exercise agency need oppose option consider book mormon remind instruct sufficiently spirit christ give know good evil life constantly confront important choice example choose follow god s commandment choose faith recognize miracle happen skeptically wait happen choose believe choose develop trust god fearfully anticipate challenge day take wrong turn highway suffer consequence poor decision especially painful blame choose receive comfort divine process repentance wrong thing right learn life change lesson experience opposition trial thing outside control moment health period sickness time peace time war hour day night season summer winter time labor follow time rest usually choose kind situation happen free choose react positive pessimistic attitude seek learn experience ask lord s help support think trial suffer adjust sail new reality decide change darkness night turn light cold winter choose wear warm clothe season sickness seek medical spiritual help choose react circumstance adjust learn seek choose action verb remember agent object let forget jesus promise pain sickness people succor help turn choose build foundation rock jesus christ whirlwind come shall power promise whosoever come receive bless come unto additional principle especially important lehi say need opposition thing mean opposite don t exist apart complement able identify joy experience sorrow point feel hungry time help especially grateful eat able identify truth see lie opposite like side coin side present charle dicken provide example idea write good time bad time let example life getting marry form family have child bring great moment joy experience life profound moment pain anguish grief happen infinite joy bliss child follow recur period sickness hospitalization sleepless night fill distress find relief prayer priesthood blessing contrast experience teach moment suffering show carry lord s succor help experience help shape wonderful way totally worthwhile come scripture find interesting example lehi teach son jacob affliction suffer wilderness help know greatness god god shall consecrate affliction gain joseph smith s cruel incarceration liberty jail lord tell thing shall experience shall good finally jesus christ s infinite sacrifice certainly great example pain suffering see bring wonderful blessing atonement god s child sunshine shadow flood bring destruction usually bring life tear grief turn tear relief happiness feeling sadness love one depart later compensate joy meet period war destruction little act kindness love happen eye ear hear world today characterize fear anxiety fear future bring jesus teach trust look unto thought doubt fear let constantly conscious effort side coin allot life side immediately visible know trust rest assure difficulty sorrow affliction pain define help grow draw close god attitude choice define well challenge health cherish grateful moment sickness seek patiently learn know change accord god s sorrow trust happiness corner consciously shift focus elevate thought positive aspect challenge undoubtedly forget grateful choose believe choose faith jesus christ choose trust god choose think celestial president russell m nelson recently teach let mindful heavenly father s wonderful plan love send beloved son help trial open door return jesus christ live stand moment wait choose provide succor strength salvation thing testify jesus christ amen note nephi nephi nephi moroni nephi alma helaman nephi nephi emphasis add charle dicken tale city nephi doctrine covenant deuteronomy doctrine covenant russell m nelson think celestial liahona nov","29":"temple house lord dot earthtemple house lord dot earthapril general conference temple house lord dot earth eld neil l andersen quorum apostle come worthily prayerfully holy house arm power don t love beautiful word sing ll strengthen thee help thee cause thee stand uphold righteous omnipotent hand lord strengthen saint age come holy house kinshasa zollikofen fukuoka oakland youth initiative overflow temple baptistry past beloved ordinance worker gray hair anymore call missionary service missionary return missionary corner world grow feeling draw house lord year ago dear family friend age live east coast united states teach missionary year say daughter want temple daughter reply mother need baptize imagebaptism elderly sister ok reply want baptize baptize day later reverently enter temple baptistry month ago receive endowment seal knowledge power god expand veil o er earth begin burst imageelderly sister outside temple wonder lord direct prophet dot earth holy temple specific time need prosperity covenant people sacred tithe hundred house lord build morning president dallin h oak show beautiful visual temple construct world kathy recently philippine think miracle manila temple dedicate year second temple cebu city complete year later temple construct design prepare dedication north south laoag tuguegarao santiago urdaneta alabang naga tacloban city iloilo bacolod cagayan de oro davao breathtake wondrous work god imagetemple philippine globe house lord come close day day lord warn day distress nation people lover self thing commotion confusion abound man s heart fail certainly see man s woman s heart fail enticement world distraction alluring voice neglect spiritual nourishment fatigue demand discipleship sadden see love time speak sincerely faith jesus christ bear witness book mormon eagerly helped build kingdom god suddenly away belief sideline church counsel don t despair god impossible prophesy commotion disbelief world lord promise covenant people people eagerly await return people stand holy setting move place speak righteous people resist deception adversary discipline faith thinking celestial trust completely savior jesus christ lord bring hundred temple close reason amid turmoil temptation world promise strengthen bless covenant saint promise fulfil promise kirtland temple holy house strengthen comfort protect find answer pleading prophet joseph smith dedication kirtland temple temple saint sing ll sing ll shout army heaven savior appear prophet old return bestow additional priesthood key restore gospel sacred occasion kirtland temple prophet pray lord s holy house saint arm power god jesus christ angel charge grow lord receive fulness holy ghost powerful supplication fulfil life faithfully worship house lord armed power house literally endow heavenly power faith jesus christ love confirm fortify spiritually assure true identity purpose life faithful bless protection temptation distraction feel savior s love lift difficulty sorrow armed power god holy house completely baptize profess belief willingness commandment temple sacredly promise covenant follow forever imagerendere heber valley utah temple youth church incredible difficult world christ heber city utah public meeting hold discuss detail temple plan construction youth fill adjoining park support propose temple young man speak government leader open forum courageously explain hope marry temple temple help clean pure describe temple symbol light hope young man woman church world embrace jesus christ imageyouth fill park heber city angel kirtland temple prophet joseph pray angel charge saint regularly perform ordinance ancestor temple bring sweet sure confirmation life continue veil experience house lord sacred share publicly share year ago live florida kathy travel temple atlanta georgia wednesday night complete session temple ordinance worker approach ask time preparatory initiatory ordinance person represent unusual eleazer cercy day temple saint prepare perform second endowment day give person represent surprisingly individual night eleazer cercy feel spirit lord endowment complete later afternoon temple kathy see elderly family friend sister dolly fernandez live atlanta male member family ask possibly assist sealing father father s parent course honor knelt end altar sacred ordinance hear inscribe mind father eleazer cercy fully believe follow life meet embrace man know mortal life eleazer cercy experience house lord bring joyful peace quiet revelation dramatic intervention assure angel charge fulness holy ghost gift holy ghost give confirm member church week worthily partake bread water remembrance savior promise spirit come willing heart house lord holy place earth grow lord receive fulness holy ghost power holy ghost fill peace joy unspeakable hope receive strength remain disciple find outside holy place president russell m nelson declare savior redeemer jesus christ perform mighty work come miraculous indication god father jesus christ preside church majesty glory dot earth house lord mighty work miraculous indication beloved friend able increase attendance temple let regularly find time worship house lord let pray temple announce property purchase government approve plan talented worker gift magnify sacred dedication bring approval heaven visit angel promise temple literally house lord promise come worthily prayerfully holy house arm power angel charge grow blessing holy ghost lord promise soul forsaketh sin cometh unto calleth obeyeth voice keepeth commandment shall face know different way face christ well place holy house day confusion commotion testify temple holy house help preserve protect prepare glorious day holy angel savior return majesty power great glory jesus christ amen note firm foundation hymn spirit god hymn currently operate temple renovation seven await dedication await rededication construction announce planning design luke timothy doctrine covenant eld david bednar say gospel principle helm ship correct principle enable find way stand firm steadfast immovable lose balance fall rage day storm darkness confusion principle gospel liahona doctrine covenant man come let deny cross follow matthew luke doctrine covenant hymn doctrine covenant prior time prophet joseph smith receive aaronic priesthood key john baptist receive melchizedek priesthood key apostle peter james john doctrine covenant doctrine covenant verse president russell m nelson say temple help quest endow god s power give ability overcome satan instigator contention peacemaker need liahona russell m nelson choice eternity worldwide devotional young adult gospel library elder colin stauffer personal correspondence jan doctrine covenant doctrine covenant doctrine covenant romans russell m nelson revelation church revelation life ensign liahona president brigham young say hundred temple thousand man woman officiate fall asleep having privilege hear obey gospel teaching president church brigham young president ezra taft benson say predecessor prophesy temple dot landscape north south america isle pacific europe redemptive work scale hundred temple need teaching ezra taft benson doctrine covenant eld david b haight say true actually see savior consult dictionary learn meaning word come know discern recognize work perceive importance come understand heavenly enlightenment blessing available temple work ensign nov","30":"wisdom lord book mormonit wisdom lord book mormonapril general conference wisdom lord book mormon president mark l pace sunday school general president prayer read book mormon year joy blessing dear brother sister grateful effort read scripture come follow thank daily connection god word profound consequence ye lay foundation great work small thing proceedeth great read savior s teaching scripture help transform home sanctuary faith center gospel learn invite spirit home holy ghost fill soul joy convert lifelong disciple jesus christ year read book holy scripture observe panorama god s teaching child major gospel dispensation dispensation see familiar pattern god restore reveal gospel jesus christ prophet people follow prophet greatly bless time people stop heed word prophet distance lord gospel apostasy gospel reveal adam child adam eve turn away lord apostasy pattern restoration apostasy repeat dispensation enoch noah abraham moses today live dispensation fulness time dispensation end apostasy dispensation usher second coming savior jesus christ millennial reign s different dispensation lord provide today especially time help draw near savior leave answer come mind scripture particularly book mormon testament jesus christ god promise general apostasy need mindful careful avoid personal apostasy remembering president russell m nelson teach responsible individual spiritual growth study book mormon year bring close savior help stay close study s good imply effort don t need learn new fact read book mormon feel connect god today nourish soul strengthen spiritually head face world find healing rough day world study scripture holy ghost great teacher deepen conversion heavenly father jesus christ help like thought mind consider holy ghost teach week study book mormon bring close savior good question scripture study home excellent question start sunday class church improve teaching church sunday improve learning home week sunday class preacheth receiveth understand edify rejoice verse spirit impress mind week s book mormon study nephi instruct jacob preserve plate hand generation generation preach sacred revelation prophesy jacob engraven plate sake people jacob later testify search scripture have witness obtain hope faith becometh unshaken verse cause remember nephi say previously brass plate obtain record search find great worth unto insomuch preserve commandment lord unto child wherefore wisdom lord carry journey wilderness land promise wisdom lehi family scripture wise today great worth spiritual power scripture continue undimmed life today people history access book mormon scripture enjoy today yes lehi family bless carry brass plate didn t copy tent important copy book mormon personal copy copy read lehi s vision tree life lehi teach importance personal experience love god partook fruit lehi see wife sariah son nephi sam little way stand know beckon unto lehi say unto loud voice come unto partake fruit desirable fruit come unto partake fruit love lehi s example intentional parenting sariah nephi sam live good righteous life lord well sweet didn t know find lehi call loud voice come tree life partake fruit direction clear misunderstanding product similar kind intentional parenting young boy maybe year old mother ask mark know holy ghost gospel true question surprise try good boy think mother like lehi know need need act know reply experience didn t surprised answer say forget remember word day heavenly father want know effort need read book mormon pray know holy ghost heavenly father answer prayer read book mormon didn t think old mother know well question ignite desire know night bedroom share brother turn light bed read chapter book mormon turn light slip bed knee pray pray sincerely great desire ask heavenly father let know truthfulness book mormon time start read book mormon feel heavenly father aware effort feel matter read pray comfortable peaceful feeling rest chapter chapter light faith grow bright inside soul time realize feeling confirmation truth holy ghost come know book mormon true jesus christ savior world grateful mother s inspire invitation experience read book mormon boy start pattern scripture study continue bless day read book mormon kneel prayer holy ghost confirm truth nephi say right wisdom lord carry scripture life book mormon keystone make dispensation different previous dispensation study book mormon follow live prophet personal apostasy life invitation come tree life hold fast word god invitation lehi family invitation mother read pray book mormon invitation prophet president russell m nelson promise say prayerfully study book mormon day well decision day promise ponder study window heaven open receive answer question direction life prayer read book mormon year joy blessing draw near savior heavenly father live jesus christ savior redeemer book mormon contain word convey love president russell m nelson lord s live prophet earth today know thing true confirm witness holy ghost witness receive read book mormon boy jesus christ amen notes doctrine covenant new home center church support integrate curriculum potential unleash power family family follow conscientiously carefully transform home sanctuary faith promise diligently work remodel home center gospel learn time sabbath day truly delight child excited learn live savior s teaching influence adversary life home decrease change family dramatic sustain russell m nelson exemplary day saint ensign liahona nov verily verily unto impart unto spirit shall enlighten mind shall fill soul joy doctrine covenant dispensation time period lord authorize servant earth bear holy priesthood key divine commission dispense gospel inhabitant earth topic question dispensation gospel library moses prophet daniel see day dispensation interpret nebuchadnezzar s dream church jesus christ day saint stone dream cut mountain hand roll forward fill earth daniel doctrine covenant god father jesus christ call prophet joseph smith prophet dispensation divine power previous dispensation restore dispensation fulness time limit time location end apostasy fill world russell m nelson gathering scatter israel ensign liahona nov russell m nelson open remark ensign liahona nov conversion goal come follow home church book mormon v doctrine covenant verses jacob jacob nephi recently announce million copy book mormon distribute dispensation truly remarkable book mormon translate language new translation process blessing book mormon print digital audio video format ryan jensen church distribute millionth copy book mormon church news dec thechurchnews com nephi emphasis add powerful spiritual influence life child righteous example love parent grandparent faithfully sacred covenant intentional parent teach child faith lord jesus christ know source look remission sin nephi casual inconsistent covenant keeping lead spiritual casualty spiritual damage great child grandchild kevin w pearson willing liahona nov doctrine covenant prophet joseph smith say tell brother book mormon correct book earth keystone religion man near god abide precept book introduction book mormon russell m nelson book mormon life like ensign liahona nov","31":"rejoice gift priesthood keysrejoice gift priesthood keysapril general conference rejoice gift priesthood key president russell m nelson president church jesus christ day saint priesthood key govern priesthood god bring lord s purpose bless accept restore gospel dear brother sister today historic day president dallin h oak year ago april sustain quorum apostle rejoice general conference include bless sacred outpouring spirit hope repeatedly study message conference come month bear function temple church st george logan manti salt lake city utah cardston alberta canada laie hawaii early temple function briefly kirtland ohio nauvoo illinois body church move west saint force leave temple nauvoo temple destroy arsonist s fire rebuild dedicate president gordon b hinckley kirtland temple desecrate enemy church later kirtland temple acquire community christ own year month announce church jesus christ day saint purchase kirtland temple significant historic site nauvoo greatly appreciate cordial mutually beneficial discussion leader community christ lead agreement imagekirtland temple kirtland temple unusual significance restoration gospel jesus christ event take place prophesy millennium essential lord s restore church fulfill day mission important event occur easter sunday april day joseph smith oliver cowdery experience series remarkable visitation lord jesus christ appear prophet record savior s eye flame fire hair head white like pure snow countenance shine brightness sun voice sound rushing great water visitation lord affirm identity say liveth slain advocate father jesus christ declare accept temple house stunning promise manifest people mercy house significant promise apply dedicated temple today invite ponder lord s promise mean personally follow savior s visitation moses appear moses confer joseph smith key gathering israel return tribe vision close elia appear commit dispensation gospel abraham joseph elijah prophet appear appearance fulfil malachi s promise second come lord send elijah turn heart father child heart child father elijah confer key sealing power joseph smith significance key return earth heavenly messenger direction lord overstate priesthood key constitute authority power presidency priesthood key govern priesthood god bring lord s purpose bless accept restore gospel jesus christ important note prior organization church heavenly messenger confer aaronic melchizedek priesthood prophet joseph give key priesthood key give joseph smith authority organize church kirtland temple conferral additional priesthood key key gathering israel key gospel abraham key sealing power essential key authorize joseph smith succeed president lord s church gather israel side veil bless covenant child blessing abraham place ratifying seal priesthood ordinance covenant seal family eternally power priesthood key infinite breathtaking consider life different priesthood key restore earth priesthood key endow power god priesthood key church serve significant teaching humanitarian organization priesthood key access essential ordinance covenant bind love one eternally allow eventually live god priesthood key distinguish church jesus christ day saint organization earth organization life well mortality organization influence life death priesthood key authority extend blessing promise abraham covenant keep man woman temple work make exquisite blessing available god s child regardless live live let rejoice priesthood key earth invite consider carefully follow statement gathering israel evidence god love child gospel abraham evidence god love child invite come unto black white bond free male female alike unto god sealing power supernal evidence god love child want choose return home priesthood key restore prophet joseph smith possible covenant keep man woman enjoy incredible personal spiritual privilege learn sacred history kirtland temple joseph smith s dedicatory prayer kirtland temple tutorial temple spiritually empower meet challenge life day encourage study prayer record doctrine covenant section dedicatory prayer receive revelation teach temple house prayer house fast house faith house learn house glory house order house god list attribute description temple promise happen serve worship house lord expect receive answer prayer personal revelation great faith strength comfort increase knowledge increase power time temple help think celestial catch vision kind life forever regular temple worship enhance way fit god s magnificent plan promise promise temple receive fulness holy ghost imagine promise mean term have heaven open earnest seeker eternal truth instruct worship temple power god angel having charge increase confidence know endowed woman man arm power god face life courage know angel help finally promise combination wickedness prevail worship house lord understand spiritual privilege possible temple vital today dear brother sister promise help hold fast iron rod worship temple regularly circumstance permit protect encounter world s mist darkness bolster testimony lord jesus christ atonement help understand god s magnificent plan soothe spirit time pain open heaven temple gateway great blessing god store temple place earth receive blessing promise abraham power direction lord temple blessing accessible member church pleased announce plan build new temple follow location uturoa french polynesia chihuahua mexico florian polis brazil rosario argentina edinburgh scotland brisbane australia south area victoria british columbia yuma arizona houston texas south area des moines iowa cincinnati ohio honolulu hawaii west jordan utah lehi utah maracaibo venezuela dear brother sister testify church jesus christ day saint stand head disciple let rejoice restoration priesthood key possible enjoy spiritual blessing willing worthy receive testify sacred jesus christ amen note fill vacancy quorum leave january death eld legrand richard eld oak fill leave january death mark e petersen september dedication rebuilt nauvoo illinois temple president gordon b hinckley occur june th anniversary martyrdom joseph hyrum smith week prophet joseph smith dedicate kirtland temple doctrine covenant doctrine covenant doctrine covenant doctrine covenant doctrine covenant perpetuation promise lord abraham thousand year early genesis nephi malachi doctrine covenant doctrine covenant doctrine covenant lord tell joseph smith dispensation time shall withhold doctrine covenant priesthood key return earth doctrine covenant doctrine covenant nephi emphasis add doctrine covenant doctrine covenant doctrine covenant doctrine covenant mean word god doctrine covenant"}}